compiler.err.abstract.cant.be.accessed.directly=\u62bd\u8c61 {0} {1} ({2} \u5185) \u306b\u76f4\u63a5\u3041\u3042\u3042\u3042 \u3042\u3049\u304f\u305b\u3057\u3085\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3053\u3068\u306f\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.abstract.cant.be.instantiated={0} \u306f abstract \u308c\u3057\u3085\u3045\u3045\u3045\u3002\u3044\u3043\u3093\u3057\u3085\u305f\u3093\u3057\u3085\u3092\u751f\u6210\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3053\u3068\u306f\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.abstract.meth.cant.have.body=abstract \u3081\u305d\u3063\u3069\u304c\u672c\u4f53\u3092\u6301\u3061\u3085\u3053\u3068\u306f\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.already.annotated={0} {1} \u306f\u6ce8\u91c8\u304c\u4ed8\u3044\u3043\u3066\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.already.defined={0} \u306f {1} \u308c\u5b9a\u7fa9\u3057\u3083\u308c\u3066\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.already.defined.single.import={0} \u306f\u5358\u4e00\u306e\u3049\u304a\u304a\u578b\u3044\u3043\u3093\u307d\u30fc\u3068\u5ba3\u8a00\u308c\u5b9a\u7fa9\u3057\u3083\u308c\u3066\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.already.defined.static.single.import={0} \u306f static \u306e\u3049\u304a\u304a\u5358\u4e00\u306e\u3049\u304a\u304a\u578b\u3044\u3043\u3093\u307d\u30fc\u3068\u5ba3\u8a00\u308c\u5b9a\u7fa9\u3057\u3083\u308c\u3066\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.already.defined.this.unit={0} \u306f\u3053\u3093\u3071\u3044\u3043\u308b\u5358\u4f4d\u308c\u5b9a\u7fa9\u3057\u3083\u308c\u3066\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.annotation.missing.default.value=\u6ce8\u91c8 {0} \u306b {1} \u304c\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u305b\u3093\u3002
compiler.err.annotation.not.valid.for.type=\u6ce8\u91c8\u306f\u305f\u3044\u3043\u3077 {0} \u306e\u3049\u304a\u304a\u5024\u306b\u6709\u52b9\u308c\u306f\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u305b\u3093\u3002
compiler.err.annotation.type.not.applicable=\u6ce8\u91c8\u578b\u306f\u3053\u306e\u3049\u304a\u304a\u7a2e\u985e\u306e\u3049\u304a\u304a\u5ba3\u8a00\u306b\u4f7f\u7528\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.annotation.value.must.be.annotation=\u6ce8\u91c8\u306e\u3049\u304a\u304a\u5024\u306f\u6ce8\u91c8\u308c\u306b\u3083\u3051\u308c\u3070\u306b\u3083\u308a\u307e\u305b\u3093\u3002
compiler.err.annotation.value.must.be.class.literal=\u6ce8\u91c8\u306e\u3049\u304a\u304a\u5024\u306f\u304f\u3089\u3057\u3085\u308a\u3066\u3089\u308b\u308c\u306b\u3083\u3051\u308c\u3070\u306b\u3083\u308a\u307e\u305b\u3093\u3002
compiler.err.annotation.value.must.be.name.value=\u6ce8\u91c8\u306e\u3049\u304a\u304a\u5024\u306f ''name=value'' \u3068\u3044\u3043\u3046\u5f62\u5f0f\u308c\u306b\u3083\u3051\u308c\u3070\u306b\u3083\u308a\u307e\u305b\u3093
compiler.err.annotation.value.not.allowable.type=\u4f7f\u7528\u308c\u304d\u306b\u3083\u3044\u3043\u305f\u3044\u3043\u3077\u306e\u3049\u304a\u304a\u6ce8\u91c8\u306e\u3049\u304a\u304a\u5024\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.annotations.not.supported.in.source=\u6ce8\u91c8\u306f -source {0} \u308c\u3057\u3083\u307d\u30fc\u3068\u3057\u3083\u308c\u3066\u3044\u3043\u307e\u305b\u3093<br>(\u6ce8\u91c8\u3092\u4f7f\u7528\u53ef\u80fd\u306b\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u306b\u306f\u3001-source 5 \u4ee5\u964d\u3092\u4f7f\u7528\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u304f\u3089\u3057\u3083\u3044\u3043)
compiler.err.anon.class.impl.intf.no.args=\u540d\u524d\u306e\u3049\u304a\u304a\u306b\u3083\u30a4\u3063\u304f\u3045\u3045\u3075\u3045\u3093\u3089\u3057\u3085\u304c\u3044\u3043\u3093\u305f\u3075\u3047\u30fc\u3057\u3085\u3092\u5b9f\u88c5\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002\u5f15\u6570\u3092\u6301\u3061\u3085\u3053\u3068\u306f\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.anon.class.impl.intf.no.qual.for.new=\u540d\u524d\u306e\u3049\u304a\u304a\u306b\u3083\u30a4\u3063\u304f\u3045\u3045\u3075\u3045\u3093\u3089\u3057\u3085\u304c\u3044\u3043\u3093\u305f\u3075\u3047\u30fc\u3057\u3085\u3092\u5b9f\u88c5\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002new \u306b\u4fee\u98fe\u5b50\u3092\u6301\u3061\u3085\u3053\u3068\u306f\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.anon.class.impl.intf.no.typeargs=\u540d\u524d\u306e\u3049\u304a\u304a\u306b\u3083\u30a4\u3063\u304f\u3045\u3045\u3075\u3045\u3093\u3089\u3057\u3085\u304c\u3044\u3043\u3093\u305f\u3075\u3047\u30fc\u3057\u3085\u3092\u5b9f\u88c5\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002\u578b\u5f15\u6570\u3092\u6301\u3061\u3085\u3053\u3068\u306f\u308c\u304d\u307e\u305b\u3093
compiler.err.array.and.varargs={2} \u308c {0} \u3068 {1} \u306e\u3049\u304a\u304a\u4e21\u65b9\u3092\u5ba3\u8a00\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3053\u3068\u306f\u308c\u304d\u307e\u305b\u3093
compiler.err.array.dimension.missing=\u914d\u5217\u306e\u3049\u304a\u304a\u5927\u304d\u3057\u3083\u304c\u6307\u5b9a\u3057\u3083\u308c\u3066\u3044\u3043\u307e\u305b\u3093\u3002
compiler.err.array.req.but.found=\u914d\u5217\u304c\u8981\u6c42\u3057\u3083\u308c\u307e\u3057\u305f\u304c\u3001{0} \u304c\u898b\u3061\u3085\u304b\u308a\u307e\u3057\u305f\u306e\u3049\u304a\u304a\u3002
compiler.err.assert.as.identifier=\u308a\u308a\u30fc\u3057\u3085 1.4 \u304b\u3089 ''assert'' \u306f\u304d\u30fc\u308f\u30fc\u3069\u306b\u3083\u306e\u3049\u304a\u304a\u308c\u3001\u8b58\u5225\u5b50\u3068\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u4f7f\u7528\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3053\u3068\u306f\u308c\u304d\u307e\u305b\u3093<br>(''assert'' \u3092\u8b58\u5225\u5b50\u3068\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u4f7f\u7528\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u306b\u306f\u3001-source 1.3 (\u307e\u305f\u306f\u305d\u308c\u4ee5\u524d\u306e\u3049\u304a\u304a\u308a\u308a\u30fc\u3057\u3085\u540d) \u3092\u4f7f\u7528\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u304f\u3089\u3057\u3083\u3044\u3043)
compiler.err.assignment.from.super-bound=\u308f\u3044\u3043\u308b\u3069\u304b\u30fc\u3069 {0} \u304b\u3089\u4ee3\u5165\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.assignment.to.extends-bound=\u308f\u3044\u3043\u308b\u3069\u304b\u30fc\u3069 {0} \u3078\u4ee3\u5165\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.attribute.value.must.be.constant=\u5c5e\u6027\u306e\u3049\u304a\u304a\u5024\u306f\u5b9a\u6570\u308c\u306b\u3083\u3051\u308c\u3070\u306b\u3083\u308a\u307e\u305b\u3093\u3002
compiler.err.break.outside.switch.loop=break \u304c switch \u6587\u307e\u305f\u306f\u308b\u30fc\u3077\u306e\u3049\u304a\u304a\u5916\u306b\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.call.must.be.first.stmt.in.ctor={0} \u306e\u3049\u304a\u304a\u547c\u3073\u51fa\u3057\u306f\u3053\u3093\u3057\u3085\u3068\u3089\u304f\u305f\u306e\u3049\u304a\u304a\u5148\u982d\u6587\u308c\u306b\u3083\u3051\u308c\u3070\u306b\u3083\u308a\u307e\u305b\u3093\u3002
compiler.err.call.to.super.not.allowed.in.enum.ctor=\u5217\u6319\u578b\u3053\u3093\u3057\u3085\u3068\u3089\u304f\u305f\u308c\u306f\u3001\u3057\u3085\u30fc\u3071\u30fc\u304f\u3089\u3057\u3085\u306e\u3049\u304a\u304a\u547c\u3073\u51fa\u3057\u306f\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.cant.access={0} \u306b\u3041\u3042\u3042\u3042 \u3042\u3049\u304f\u305b\u3057\u3085\u308c\u304d\u307e\u305b\u3093\u3002<br>{1}
compiler.err.cant.apply.symbol={0} ({1} \u5185) \u3092 {2}({3}) \u306b\u9069\u7528\u308c\u304d\u307e\u305b\u3093
compiler.err.cant.apply.symbol.1={0} ({1} \u5185) \u3092 {2}({3}) \u306b\u9069\u7528\u308c\u304d\u307e\u305b\u3093; {4}
compiler.err.cant.assign.val.to.final.var=final \u5909\u6570 {0} \u306b\u5024\u3092\u4ee3\u5165\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3053\u3068\u306f\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.cant.deref={0} \u306f\u9593\u63a5\u53c2\u7167\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.cant.extend.intf.annotation=@interfaces \u308c\u306f ''extends'' \u306f\u8a31\u53ef\u3057\u3083\u308c\u307e\u305b\u3093
compiler.err.cant.inherit.diff.arg={0} \u3092\u7570\u306b\u3083\u308b\u5f15\u6570 <{1}> \u3068 <{2}> \u308c\u7d99\u627f\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3053\u3068\u306f\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.cant.inherit.from.final=final {0} \u304b\u3089\u306f\u7d99\u627f\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.cant.read.file={0} \u3092\u8aad\u307f\u8fbc\u3081\u307e\u305b\u3093\u3002
compiler.err.cant.ref.before.ctor.called=\u3057\u3085\u30fc\u3071\u30fc\u305f\u3044\u3043\u3077\u306e\u3049\u304a\u304a\u3053\u3093\u3057\u3085\u3068\u3089\u304f\u305f\u306e\u3049\u304a\u304a\u547c\u3073\u51fa\u3057\u524d\u306f {0} \u3092\u53c2\u7167\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.cant.resolve=\u3057\u3093\u307c\u308b\u3092\u898b\u3061\u3085\u3051\u3089\u308c\u307e\u305b\u3093\u3002<br>\u3057\u3093\u307c\u308b: {0} {3}{1}{2}
compiler.err.cant.resolve.location=\u3057\u3093\u307c\u308b\u3092\u898b\u3061\u3085\u3051\u3089\u308c\u307e\u305b\u3093\u3002<br>\u3057\u3093\u307c\u308b: {0} {3}{1}{2}<br>\u5834\u6240    : {5} \u306e\u3049\u304a\u304a {4}
compiler.err.cant.ret.val.from.meth.decl.void=\u623b\u308a\u5024\u306e\u3049\u304a\u304a\u578b\u304c void \u306e\u3049\u304a\u304a\u3081\u305d\u3063\u3069\u304b\u3089\u306f\u5024\u3092\u8fd4\u305b\u307e\u305b\u3093\u3002
compiler.err.cant.select.static.class.from.param.type=\u3071\u3089\u3081\u30fc\u305f\u306b\u3057\u3083\u308c\u305f\u578b\u304b\u3089 static \u304f\u3089\u3057\u3085\u3092\u9078\u629e\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3053\u3068\u306f\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.catch.without.try=''catch'' \u3078\u306e\u3049\u304a\u304a ''try'' \u304c\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u305b\u3093\u3002
compiler.err.clash.with.pkg.of.same.name={0} \u306f\u540c\u540d\u306e\u3049\u304a\u304a\u3071\u3063\u3051\u30fc\u3058\u3068\u7af6\u5408\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3002
compiler.err.class.cant.write={0} \u306e\u3049\u304a\u304a\u66f8\u304d\u8fbc\u307f\u4e2d\u306b\u3048\u3089\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u306e\u3049\u304a\u304a\u3002{1}
compiler.err.class.public.should.be.in.file=\u304f\u3089\u3057\u3085 {0} \u306f public \u308c\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u3001\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b\u306e\u3049\u304a\u304a {0}.java \u308c\u5ba3\u8a00\u3057\u306b\u3083\u3051\u308c\u3070\u306b\u3083\u308a\u307e\u305b\u3093\u3002
compiler.err.concrete.inheritance.conflict={1} \u306e\u3049\u304a\u304a\u3081\u305d\u3063\u3069 {0} \u3068 {3} \u306e\u3049\u304a\u304a {2} \u306f\u540c\u3058\u3057\u3050\u306b\u3072\u3083\u30fc\u304b\u3089\u7d99\u627f\u3057\u3083\u308c\u3066\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.const.expr.req=\u5b9a\u6570\u5f0f\u304c\u5fc5\u8981\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.cont.outside.loop=continue \u304c\u308b\u30fc\u3077\u306e\u3049\u304a\u304a\u5916\u306b\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.cyclic.annotation.element=\u6ce8\u91c8\u306e\u3049\u304a\u304a\u8981\u7d20\u305f\u3044\u3043\u3077\u304c\u308b\u30fc\u3077\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.cyclic.inheritance={0} \u3092\u542b\u3080\u7d99\u627f\u304c\u308b\u30fc\u3077\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.default.allowed.in.intf.annotation.member=\u308c\u3075\u3049\u308b\u3068\u5024\u306f @interface \u3081\u3093\u3070\u5185\u308c\u306e\u3049\u304a\u304a\u307f\u4f7f\u7528\u308c\u304d\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.does.not.override.abstract={0} \u306f abstract \u308c\u306b\u3083\u304f\u3001{2} \u5185\u306e\u3049\u304a\u304a abstract \u3081\u305d\u3063\u3069 {1} \u3092\u304a\uff9e\u3049\u304a\u30a9\u304a\u3093\u30fc\u3070\u30fc\u3089\u3044\u3043\u3069\u3057\u307e\u305b\u3093\u3002
compiler.err.doesnt.exist=\u3071\u3063\u3051\u30fc\u3058 {0} \u306f\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
compiler.err.dot.class.expected=''.class'' \u304c\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u305b\u3093\u3002
compiler.err.duplicate.annotation=\u6ce8\u91c8\u304c\u91cd\u8907\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.duplicate.annotation.member.value={1} \u306e\u3049\u304a\u304a\u6ce8\u91c8\u3081\u3093\u3070\u306e\u3049\u304a\u304a\u5024 {0} \u304c\u91cd\u8907\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.duplicate.case.label=case \u3089\u3079\u308b\u304c\u91cd\u8907\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.duplicate.class=\u304f\u3089\u3057\u3085 {0} \u304c\u91cd\u8907\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.duplicate.default.label=default \u3089\u3079\u308b\u304c\u91cd\u8907\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.else.without.if=''else'' \u3078\u306e\u3049\u304a\u304a ''if'' \u304c\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u305b\u3093\u3002
compiler.err.empty.char.lit=\u7a7a\u306e\u3049\u304a\u304a\u6587\u5b57\u308a\u3066\u3089\u308b\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.encl.class.required={0} \u3092\u542b\u3080\u56f2\u3046\u3044\u3043\u3093\u3057\u3085\u305f\u3093\u3057\u3085\u304c\u5fc5\u8981\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.enum.annotation.must.be.enum.constant=\u5217\u6319\u578b\u6ce8\u91c8\u5024\u306f\u3001\u5217\u6319\u578b\u5b9a\u6570\u308c\u306b\u3083\u3051\u308c\u3070\u306b\u3083\u308a\u307e\u305b\u3093\u3002
compiler.err.enum.as.identifier=\u308a\u308a\u30fc\u3057\u3085 5 \u304b\u3089 ''enum'' \u306f\u304d\u30fc\u308f\u30fc\u3069\u306b\u3083\u306e\u3049\u304a\u304a\u308c\u8b58\u5225\u5b50\u3068\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u4f7f\u7528\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3053\u3068\u306f\u308c\u304d\u307e\u305b\u3093<br>(''enum'' \u3092\u8b58\u5225\u5b50\u3068\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u4f7f\u7528\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u306b\u306f -source 1.4 \u307e\u305f\u306f\u305d\u308c\u4ee5\u524d\u3092\u4f7f\u7528\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u304f\u3089\u3057\u3083\u3044\u3043)
compiler.err.enum.cant.be.instantiated=\u5217\u6319\u578b\u305f\u3044\u3043\u3077\u306f\u3072\u3043\u3093\u3057\u3085\u305f\u3093\u3057\u3085\u5316\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.enum.const.req=\u4fee\u98fe\u3057\u3083\u308c\u3066\u3044\u3043\u306b\u3083\u3044\u3043\u5217\u6319\u578b\u5b9a\u6570\u306e\u3049\u304a\u304a\u540d\u524d\u304c\u5fc5\u8981\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.enum.label.must.be.unqualified.enum=\u5217\u6319\u578b\u306e\u3049\u304a\u304a switch case \u3089\u3079\u308b\u306f\u5217\u6319\u578b\u5b9a\u6570\u306e\u3049\u304a\u304a\u975e\u4fee\u98fe\u540d\u308c\u306b\u3083\u3051\u308c\u3070\u306b\u3083\u308a\u307e\u305b\u3093\u3002
compiler.err.enum.no.finalize=\u5217\u6319\u578b\u305f\u3044\u3043\u3077\u306f finalize \u3081\u305d\u3063\u3069\u3092\u6301\u3061\u3085\u3053\u3068\u306f\u308c\u304d\u307e\u305b\u3093
compiler.err.enum.no.subclassing=\u304f\u3089\u3057\u3085\u306f\u76f4\u63a5 java.lang.Enum \u3092\u62e1\u5f35\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.enum.types.not.extensible=\u5217\u6319\u578b\u305f\u3044\u3043\u3077\u306f\u62e1\u5f35\u53ef\u80fd\u308c\u306f\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u305b\u3093\u3002
compiler.err.enums.must.be.static=\u5217\u6319\u578b\u306e\u3049\u304a\u304a\u5ba3\u8a00\u306f static \u3053\u3093\u3066\u304d\u3057\u3085\u3068\u308c\u3057\u304b\u4f7f\u7528\u308c\u304d\u307e\u305b\u3093
compiler.err.enums.not.supported.in.source=\u5217\u6319\u578b\u306f -source {0} \u308c\u3057\u3083\u307d\u30fc\u3068\u3057\u3083\u308c\u3066\u3044\u3043\u307e\u305b\u3093<br>(\u5217\u6319\u578b\u3092\u4f7f\u7528\u53ef\u80fd\u306b\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u306b\u306f -source 5 \u4ee5\u964d\u3092\u4f7f\u7528\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u304f\u3089\u3057\u3083\u3044\u3043)
compiler.err.error=\u3048\u3089\u30fc:
compiler.err.error.reading.file={0} \u306e\u3049\u304a\u304a\u8aad\u307f\u8fbc\u307f\u3048\u3089\u30fc\u308c\u3057\u3085\u3045\u3045\u3045\u3002{1}
compiler.err.except.already.caught=\u4f8b\u5916 {0} \u306f\u3057\u3085\u308c\u306b\u304d\u3083\u3063\u3061\u3057\u3083\u308c\u3066\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.except.never.thrown.in.try=\u4f8b\u5916 {0} \u306f\u5bfe\u5fdc\u3057\u3085\u308b\u306e\u3049\u304a\u304a try \u6587\u306e\u3049\u304a\u304a\u672c\u4f53\u308c\u306f\u3057\u3085\u308d\u30fc\u3057\u3083\u308c\u307e\u305b\u3093\u3002
compiler.err.expected={0} \u304c\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u305b\u3093\u3002
compiler.err.expected2={0} \u307e\u305f\u306f {1} \u304c\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u305b\u3093\u3002
compiler.err.expected3={0}\u3001{1}\u3001\u307e\u305f\u306f {2} \u304c\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u305b\u3093\u3002
compiler.err.final.parameter.may.not.be.assigned=final \u3071\u3089\u3081\u30fc\u305f\u306e\u3049\u304a\u304a {0} \u306b\u5024\u3092\u4ee3\u5165\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3053\u3068\u306f\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.finally.without.try=''finally'' \u3078\u306e\u3049\u304a\u304a ''try'' \u304c\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u305b\u3093\u3002
compiler.err.foreach.not.applicable.to.type=foreach \u306f\u5f0f\u306e\u3049\u304a\u304a\u305f\u3044\u3043\u3077\u306b\u4f7f\u7528\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.foreach.not.supported.in.source=for-each \u308b\u30fc\u3077\u306f -source {0} \u308c\u3057\u3083\u307d\u30fc\u3068\u3057\u3083\u308c\u3066\u3044\u3043\u307e\u305b\u3093<br>(for-each \u308b\u30fc\u3077\u3092\u4f7f\u7528\u53ef\u80fd\u306b\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u306b\u306f\u3001-source 5 \u4ee5\u964d\u3092\u4f7f\u7528\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u304f\u3089\u3057\u3083\u3044\u3043)
compiler.err.fp.number.too.large=\u6d6e\u52d5\u5c0f\u6570\u70b9\u6570\u304c\u5927\u304d\u904e\u304e\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.fp.number.too.small=\u6d6e\u52d5\u5c0f\u6570\u70b9\u6570\u304c\u5c0f\u3057\u3083\u904e\u304e\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.generic.array.creation=\u6c4e\u7528\u914d\u5217\u3092\u4f5c\u6210\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3002
compiler.err.generic.throwable=\u6c4e\u7528\u304f\u3089\u3057\u3085\u306f java.lang.Throwable \u3092\u62e1\u5f35\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.generics.not.supported.in.source=\u7dcf\u79f0\u578b\u306f -source {0} \u308c\u3057\u3083\u307d\u30fc\u3068\u3057\u3083\u308c\u3066\u3044\u3043\u307e\u305b\u3093<br>(\u7dcf\u79f0\u578b\u3092\u4f7f\u7528\u53ef\u80fd\u306b\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u306b\u306f\u3001-source 5 \u4ee5\u964d\u3092\u4f7f\u7528\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u304f\u3089\u3057\u3083\u3044\u3043)
compiler.err.icls.cant.have.static.decl=\u5185\u90e8\u304f\u3089\u3057\u3085\u304c static \u5ba3\u8a00\u3092\u6301\u3061\u3085\u3053\u3068\u306f\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.illegal.char=\{0} \u306f\u4e0d\u6b63\u306b\u3083\u6587\u5b57\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.illegal.char.for.encoding=\u3053\u306e\u3049\u304a\u304a\u6587\u5b57\u306f\u3001\u3048\u3093\u3053\u30fc\u308c\u3043\u3093\u3050 {0} \u306b\u307e\u3063\u3077\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.illegal.combination.of.modifiers=\u4fee\u98fe\u5b50 {0} \u3068 {1} \u306e\u3049\u304a\u304a\u7d44\u307f\u5408\u308f\u305b\u306f\u4e0d\u6b63\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.illegal.enum.static.ref=\u521d\u671f\u5316\u5b50\u304b\u3089 static \u3075\u3043\u30fc\u308b\u3069\u3078\u306e\u3049\u304a\u304a\u53c2\u7167\u304c\u4e0d\u6b63\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.illegal.esc.char=\u3048\u3057\u3085\u3051\u30fc\u3077\u6587\u5b57\u304c\u4e0d\u6b63\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.illegal.forward.ref=\u9806\u65b9\u5411\u53c2\u7167\u304c\u4e0d\u6b63\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.illegal.generic.type.for.instof=instanceof \u306e\u3049\u304a\u304a\u7dcf\u79f0\u578b\u304c\u4e0d\u6b63\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.illegal.initializer.for.type={0} \u306e\u3049\u304a\u304a\u521d\u671f\u5316\u5b50\u304c\u4e0d\u6b63\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.illegal.line.end.in.char.lit=\u6587\u5b57\u308a\u3066\u3089\u308b\u306e\u3049\u304a\u304a\u884c\u672b\u304c\u4e0d\u6b63\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.illegal.nonascii.digit=\u4e0d\u6b63\u306b\u3083\u975e ASCII \u6570\u5b57\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.illegal.qual.not.icls=\u4fee\u98fe\u5b50\u304c\u4e0d\u6b63\u308c\u3057\u3085\u3045\u3045\u3045\u3002{0} \u306f\u5185\u90e8\u304f\u3089\u3057\u3085\u308c\u306f\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u305b\u3093\u3002
compiler.err.illegal.start.of.expr=\u5f0f\u306e\u3049\u304a\u304a\u958b\u59cb\u304c\u4e0d\u6b63\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.illegal.start.of.type=\u578b\u306e\u3049\u304a\u304a\u958b\u59cb\u304c\u4e0d\u6b63\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.illegal.unicode.esc=Unicode \u3048\u3057\u3085\u3051\u30fc\u3077\u304c\u4e0d\u6b63\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.import.requires.canonical=\u3044\u3043\u3093\u307d\u30fc\u3068\u306b\u306f {0} \u306e\u3049\u304a\u304a\u6a19\u6e96\u540d\u304c\u5fc5\u8981\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.improperly.formed.type.inner.raw.param=\u578b\u306e\u3049\u304a\u304a\u5f62\u5f0f\u304c\u4e0d\u9069\u5207\u308c\u3057\u3085\u3045\u3045\u3045\u3002raw \u578b\u306b\u6307\u5b9a\u3057\u3083\u308c\u305f\u578b\u3071\u3089\u3081\u30fc\u305f\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.improperly.formed.type.param.missing=\u578b\u306e\u3049\u304a\u304a\u5f62\u5f0f\u304c\u4e0d\u9069\u5207\u308c\u3057\u3085\u3045\u3045\u3045\u3002\u3071\u3089\u3081\u30fc\u305f\u304c\u4e0d\u8db3\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.incomparable.types=\u578b {0} \u3068 {1} \u306f\u6bd4\u8f03\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.initializer.must.be.able.to.complete.normally=\u521d\u671f\u5316\u5b50\u306f\u6b63\u5e38\u306b\u5b8c\u4e86\u308c\u304d\u306b\u3083\u3051\u308c\u3070\u306b\u3083\u308a\u307e\u305b\u3093\u3002
compiler.err.int.number.too.large=\u6574\u6570 {0} \u304c\u5927\u304d\u904e\u304e\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.internal.error.cant.instantiate=\u5185\u90e8\u3048\u3089\u30fc\u308c\u3057\u3085\u3045\u3045\u3045\u3002{0} \u3092 {1} \u308c ({2}) \u306b\u3044\u3043\u3093\u3057\u3085\u305f\u3093\u3057\u3085\u751f\u6210\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.intf.annotation.cant.have.type.params=@interface \u304c\u578b\u3071\u3089\u3081\u30fc\u305f\u3092\u6301\u3061\u3085\u3053\u3068\u306f\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.intf.annotation.member.clash=@interface \u3081\u3093\u3070\u30fc\u306f {1} \u306e\u3049\u304a\u304a\u3081\u305d\u3063\u3069 ''{0}'' \u3068\u7af6\u5408\u3057\u3085\u308b\u306e\u3049\u304a\u304a
compiler.err.intf.annotation.members.cant.have.params=@interface \u3081\u3093\u3070\u304c\u3071\u3089\u3081\u30fc\u305f\u3092\u6301\u3061\u3085\u3053\u3068\u306f\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.intf.annotation.members.cant.have.type.params=@interface \u3081\u3093\u3070\u304c\u578b\u3071\u3089\u3081\u30fc\u305f\u3092\u6301\u3061\u3085\u3053\u3068\u306f\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.intf.expected.here=\u3053\u3053\u306b\u3044\u3043\u3093\u305f\u3075\u3047\u30fc\u3057\u3085\u304c\u5fc5\u8981\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.intf.meth.cant.have.body=\u3044\u3043\u3093\u305f\u3075\u3047\u30fc\u3057\u3085\u3081\u305d\u3063\u3069\u304c\u672c\u4f53\u3092\u6301\u3061\u3085\u3053\u3068\u306f\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.intf.not.allowed.here=\u3053\u3053\u308c\u306f\u3072\u3043\u3093\u305f\u3075\u3047\u30fc\u3057\u3085\u306f\u8a31\u53ef\u3057\u3083\u308c\u307e\u305b\u3093
compiler.err.invalid.annotation.member.type=\u6ce8\u91c8\u3081\u3093\u3070\u306e\u3049\u304a\u304a\u578b\u304c\u4e0d\u6b63\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.invalid.hex.number=16 \u9032\u6570\u306b\u306f 16 \u9032\u6570\u5b57\u304c\u6700\u4f4e 1 \u3061\u3085\u306f\u542b\u307e\u308c\u3066\u3044\u3043\u306b\u3083\u3051\u308c\u3070\u306b\u3083\u308a\u307e\u305b\u3093\u3002
compiler.err.invalid.meth.decl.ret.type.req=\u3081\u305d\u3063\u3069\u306e\u3049\u304a\u304a\u5ba3\u8a00\u304c\u4e0d\u6b63\u308c\u3057\u3085\u3045\u3045\u3045\u3002\u623b\u308a\u5024\u306e\u3049\u304a\u304a\u578b\u304c\u5fc5\u8981\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.io.exception=\u305d\u30fc\u3057\u3085\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b\u306e\u3049\u304a\u304a\u8aad\u307f\u53d6\u308a\u3048\u3089\u30fc\u308c\u3057\u3085\u3045\u3045\u3045: {0}
compiler.err.label.already.in.use=\u3089\u3079\u308b\u306e\u3049\u304a\u304a {0} \u306f\u3057\u3085\u308c\u306b\u4f7f\u308f\u308c\u3066\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.limit.code=\u3053\u30fc\u3069\u304c\u5927\u304d\u3057\u3085\u304e\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.limit.code.too.large.for.try.stmt=try \u6587\u306e\u3049\u304a\u304a\u3053\u30fc\u3069\u304c\u5927\u304d\u3057\u3085\u304e\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.limit.dimensions=\u914d\u5217\u578b\u306e\u3049\u304a\u304a\u6b21\u5143\u304c\u591a\u3057\u3085\u304e\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.limit.locals=\u308d\u30fc\u304b\u308b\u5909\u6570\u304c\u591a\u3057\u3085\u304e\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.limit.parameters=\u3071\u3089\u3081\u30fc\u305f\u304c\u591a\u3057\u3085\u304e\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.limit.pool=\u5b9a\u6570\u304c\u591a\u3057\u3085\u304e\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.limit.pool.in.class=\u304f\u3089\u3057\u3085 {0} \u5185\u306e\u3049\u304a\u304a\u5b9a\u6570\u304c\u591a\u3057\u3085\u304e\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.limit.stack=\u3053\u30fc\u3069\u304c\u8981\u6c42\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3057\u3085\u305f\u3063\u304f\u304c\u591a\u3057\u3085\u304e\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.limit.string=\u5b9a\u6570\u6587\u5b57\u5217\u304c\u9577\u3057\u3085\u304e\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.limit.string.overflow=\u6587\u5b57\u5217 "{0}..." \u306e\u3049\u304a\u304a UTF8 \u8868\u73fe\u304c\u3001\u5b9a\u6570\u3077\u30fc\u308b\u306b\u5bfe\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u9577\u3057\u3085\u304e\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.local.enum=\u5217\u6319\u578b\u306f\u308d\u30fc\u304b\u308b\u308c\u306f\u3072\u3043\u3051\u307e\u305b\u3093\u3002
compiler.err.local.var.accessed.from.icls.needs.final=\u308d\u30fc\u304b\u308b\u5909\u6570 {0} \u306f\u5185\u90e8\u304f\u3089\u3057\u3085\u304b\u3089\u3041\u3042\u3042\u3042 \u3042\u3049\u304f\u305b\u3057\u3085\u3057\u3083\u308c\u307e\u3057\u3085\u3045\u3045\u3045\u3002final \u308c\u5ba3\u8a00\u3057\u3083\u308c\u308b\u5fc5\u8981\u304c\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.malformed.fp.lit=\u6d6e\u52d5\u5c0f\u6570\u70b9\u308a\u3066\u3089\u308b\u304c\u4e0d\u6b63\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.method.does.not.override.superclass=\u3081\u305d\u3063\u3069\u306f\u3057\u3085\u30fc\u3071\u30fc\u305f\u3044\u3043\u3077\u306e\u3049\u304a\u304a\u3081\u305d\u3063\u3069\u3092\u304a\uff9e\u3049\u304a\u30a9\u304a\u3093\u30fc\u3070\u30fc\u3089\u3044\u3043\u3069\u307e\u305f\u306f\u5b9f\u88c5\u3057\u307e\u305b\u3093
compiler.err.missing.meth.body.or.decl.abstract=\u3081\u305d\u3063\u3069\u672c\u4f53\u304c\u306b\u3083\u3044\u3043\u304b\u3001abstract \u3068\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u5ba3\u8a00\u3057\u3083\u308c\u3066\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.missing.ret.stmt=return \u6587\u304c\u6307\u5b9a\u3057\u3083\u308c\u3066\u3044\u3043\u307e\u305b\u3093\u3002
compiler.err.missing.ret.val=\u623b\u308a\u5024\u304c\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u305b\u3093\u3002
compiler.err.mod.not.allowed.here=\u4fee\u98fe\u5b50 {0} \u3092\u3053\u3053\u308c\u4f7f\u3046\u3053\u3068\u306f\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.name.clash.same.erasure=\u540d\u524d\u304c\u7af6\u5408\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002{0} \u3068 {1} \u306f\u524a\u9664\u5f8c\u306e\u3049\u304a\u304a\u540d\u524d\u304c\u540c\u3058\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.name.clash.same.erasure.no.override=\u540d\u524d\u304c\u7af6\u5408\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002{1} \u306e\u3049\u304a\u304a {0} \u3068 {3} \u306e\u3049\u304a\u304a {2} \u306f\u307e\u3089\u4ed6\u65b9\u3092\u304a\uff9e\u3049\u304a\u30a9\u304a\u3093\u30fc\u3070\u30fc\u3089\u3044\u3043\u3069\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u3044\u3043\u307e\u305b\u3093\u304c\u3001\u524a\u9664\u5f8c\u306e\u3049\u304a\u304a\u540d\u524d\u304c\u540c\u3058\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.name.reserved.for.internal.use={0} \u306f\u5185\u90e8\u308c\u306e\u3049\u304a\u304a\u4f7f\u7528\u306e\u3049\u304a\u304a\u305f\u3081\u4e88\u7d04\u3057\u3083\u308c\u3066\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.native.meth.cant.have.body=native \u3081\u305d\u3063\u3069\u304c\u672c\u4f53\u3092\u6301\u3061\u3085\u3053\u3068\u306f\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.neither.conditional.subtype=? \u306b\u5bfe\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u4e92\u63db\u6027\u306e\u3049\u304a\u304a\u306b\u3083\u3044\u3043\u578b : \u3069\u3061\u3089\u3082\u4ed6\u65b9\u306e\u3049\u304a\u304a\u3057\u3083\u3076\u305f\u3044\u3043\u3077\u308c\u306f\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u305b\u3093\u3002<br>2 \u756a\u76ee\u306e\u3049\u304a\u304a\u304a\uff9e\u3049\u304a\u30a9\u304a\u3093\u307a\u3089\u3093\u3069 : {0}<br>3 \u756a\u76ee\u306e\u3049\u304a\u304a\u304a\uff9e\u3049\u304a\u30a9\u304a\u3093\u307a\u3089\u3093\u3069 : {1}
compiler.err.new.not.allowed.in.annotation=''new'' \u306f\u6ce8\u91c8\u306b\u4f7f\u7528\u308c\u304d\u307e\u305b\u3093
compiler.err.no.annotation.member={1} \u306e\u3049\u304a\u304a\u6ce8\u91c8\u3081\u3093\u3070 {0} \u304c\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u305b\u3093\u3002
compiler.err.no.encl.instance.of.type.in.scope=\u578b {0} \u306e\u3049\u304a\u304a\u5185\u90e8\u304f\u3089\u3057\u3085\u3092\u56f2\u3080\u3044\u3043\u3093\u3057\u3085\u305f\u3093\u3057\u3085\u304c\u3057\u3085\u3053\u30fc\u3077\u5185\u306b\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u305b\u3093\u3002
compiler.err.no.intf.expected.here=\u3053\u3053\u306b\u3044\u3043\u3093\u305f\u3075\u3047\u30fc\u3057\u3085\u306f\u5fc5\u8981\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u305b\u3093\u3002
compiler.err.no.match.entry={0} \u306f {1} \u306e\u3049\u304a\u304a\u3048\u3093\u3068\u308a\u306b\u9069\u5408\u3057\u307e\u305b\u3093\u3002{2} \u304c\u5fc5\u8981\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.no.superclass={0} \u306b\u306f\u3057\u3085\u30fc\u3071\u30fc\u304f\u3089\u3057\u3085\u304c\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u305b\u3093\u3002
compiler.err.non-static.cant.be.ref=static \u308c\u306b\u3083\u3044\u3043\u306e\u3049\u304a\u304a {0} {1} \u3092 static \u3053\u3093\u3066\u304d\u3057\u3085\u3068\u304b\u3089\u53c2\u7167\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3053\u3068\u306f\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.not.annotation.type={0} \u306f\u6ce8\u91c8\u578b\u308c\u306f\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u305b\u3093\u3002
compiler.err.not.def.access.class.intf.cant.access={1} \u306e\u3049\u304a\u304a {0} \u304c\u3041\u3042\u3042\u3042 \u3042\u3049\u304f\u305b\u3057\u3085\u308c\u304d\u306b\u3083\u30a4\u3063\u304f\u3045\u3045\u3075\u3045\u3093\u3089\u3057\u3085\u307e\u305f\u306f\u3072\u3043\u3093\u305f\u3075\u3047\u30fc\u3057\u3085\u306b\u5b9a\u7fa9\u3057\u3083\u308c\u3066\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045
compiler.err.not.def.public.cant.access={1} \u306e\u3049\u304a\u304a {0} \u306f public \u308c\u306f\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u305b\u3093\u3002\u3071\u3063\u3051\u30fc\u3058\u5916\u304b\u3089\u306f\u3041\u3042\u3042\u3042 \u3042\u3049\u304f\u305b\u3057\u3085\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.not.encl.class={0} \u306f\u5185\u90e8\u304f\u3089\u3057\u3085\u3092\u56f2\u307f\u307e\u305b\u3093\u3002
compiler.err.not.loop.label={0} \u306f\u308b\u30fc\u3077\u3089\u3079\u308b\u308c\u306f\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u305b\u3093\u3002
compiler.err.not.stmt=\u6587\u308c\u306f\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u305b\u3093\u3002
compiler.err.not.within.bounds=\u578b\u3071\u3089\u3081\u30fc\u305f\u306e\u3049\u304a\u304a {0} \u306f\u305d\u306e\u3049\u304a\u304a\u7bc4\u56f2\u3092\u8d8a\u3048\u3066\u3078\u3047\u3048\u3048\u3047\uff9e\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.not.within.bounds.explain=\u578b\u3071\u3089\u3081\u30fc\u305f\u306e\u3049\u304a\u304a {0} \u306f\u305d\u306e\u3049\u304a\u304a\u7bc4\u56f2\u3092\u8d8a\u3048\u3066\u3078\u3047\u3048\u3048\u3047\uff9e\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002{1}
compiler.err.operator.cant.be.applied=\u6f14\u7b97\u5b50 {0} \u306f {1} \u306b\u9069\u7528\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.orphaned={0} \u306b\u306f\u89aa\u304c\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u305b\u3093\u3002
compiler.err.override.meth={0}\u304a\uff9e\u3049\u304a\u30a9\u304a\u3093\u30fc\u3070\u30fc\u3089\u3044\u3043\u3069\u3057\u3083\u308c\u305f\u3081\u305d\u3063\u3069\u306f {1} \u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.override.meth.doesnt.throw={0}\u304a\uff9e\u3049\u304a\u30a9\u304a\u3093\u30fc\u3070\u30fc\u3089\u3044\u3043\u3069\u3057\u3083\u308c\u305f\u3081\u305d\u3063\u3069\u306f {1} \u3092\u3057\u3085\u308d\u30fc\u3057\u307e\u305b\u3093\u3002
compiler.err.override.static={0}\u304a\uff9e\u3049\u304a\u30a9\u304a\u3093\u30fc\u3070\u30fc\u3089\u3044\u3043\u3069\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3081\u305d\u3063\u3069\u304c static \u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.override.weaker.access={0}\u3057\u3085\u30fc\u3071\u30fc\u304f\u3089\u3057\u3085\u308c\u306e\u3049\u304a\u304a\u5b9a\u7fa9 ({1}) \u3088\u308a\u5f31\u3044\u3043\u3041\u3042\u3042\u3042 \u3042\u3049\u304f\u305b\u3057\u3085\u7279\u6a29\u3092\u5272\u308a\u5f53\u3066\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u306e\u3049\u304a\u304a\u3002
compiler.err.pkg.annotations.sb.in.package-info.java=\u3071\u3063\u3051\u30fc\u3058\u306e\u3049\u304a\u304a\u6ce8\u91c8\u306f\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b\u306e\u3049\u304a\u304a package-info.java \u5185\u306b\u306b\u3083\u3051\u308c\u3070\u306b\u3083\u308a\u307e\u305b\u3093\u3002
compiler.err.pkg.clashes.with.class.of.same.name=\u3071\u3063\u3051\u30fc\u3058 {0} \u306f\u540c\u540d\u306e\u3049\u304a\u304a\u304f\u3089\u3057\u3085\u3068\u7af6\u5408\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.premature.eof=\u69cb\u6587\u89e3\u6790\u4e2d\u306b\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b\u306e\u3049\u304a\u304a\u7d42\u308f\u308a\u306b\u79fb\u308a\u307e\u3057\u305f\u306e\u3049\u304a\u304a
compiler.err.prob.found.req={0}<br>\u691c\u51fa\u5024  : {1}<br>\u671f\u5f85\u5024  : {2}
compiler.err.prob.found.req.1={0} {3}<br>\u691c\u51fa\u5024  : {1}<br>\u671f\u5f85\u5024  : {2}
compiler.err.proc.bad.config.file=\u3057\u3083\u30fc\u3073\u3057\u3085\u69cb\u6210\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b\u304c\u4e0d\u6b63\u308c\u3041\u3042\u3042\u3042 \u3042\u3049\u308b\u304b\u3001\u3077\u308d\u305b\u3063\u3057\u3083\u304a\uff9e\u3049\u304a\u30a9\u304a\u3093\u3076\u3058\u3047\u304f\u3068\u306e\u3049\u304a\u304a\u69cb\u7bc9\u4e2d\u306b\u4f8b\u5916\u304c\u3057\u3085\u308d\u30fc\u3057\u3083\u308c\u307e\u3057\u305f: {0}
compiler.err.proc.cant.access={0} \u306b\u3041\u3042\u3042\u3042 \u3042\u3049\u304f\u305b\u3057\u3085\u308c\u304d\u307e\u305b\u3093<br>{1}<br>\u8a73\u7d30\u306f\u6b21\u306e\u3049\u304a\u304a\u3057\u3085\u305f\u3063\u304f\u3068\u308c\u30fc\u3057\u3085\u308c\u8abf\u67fb\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u304f\u3089\u3057\u3083\u3044\u3043\u306b\u3083\u306e\u3049\u304a\u304a\u3002<br>{2}
compiler.err.proc.cant.create.loader=\u6ce8\u91c8\u3077\u308d\u305b\u3063\u3057\u3083\u306e\u3049\u304a\u304a\u304f\u3089\u3057\u3085\u308d\u30fc\u3089\u30fc\u3092\u4f5c\u6210\u308c\u304d\u307e\u305b\u3093\u308c\u3057\u305f: {0}
compiler.err.proc.cant.find.class=''{0}'' \u306e\u3049\u304a\u304a\u304f\u3089\u3057\u3085\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b\u304c\u898b\u3061\u3085\u304b\u308a\u307e\u305b\u3093\u308c\u3057\u305f\u306e\u3049\u304a\u304a\u3002
compiler.err.proc.messager={0}
compiler.err.proc.no.explicit.annotation.processing.requested=\u304f\u3089\u3057\u3085\u540d ''{0}'' \u304c\u53d7\u3051\u5165\u308c\u3089\u308c\u308b\u306e\u3049\u304a\u304a\u306f\u3001\u6ce8\u91c8\u51e6\u7406\u304c\u660e\u793a\u7684\u306b\u8981\u6c42\u3057\u3083\u308c\u305f\u5834\u5408\u3089\u3051\u308c\u3057\u3085\u3045\u3045\u3045
compiler.err.proc.processor.bad.option.name=\u3077\u308d\u305b\u3063\u3057\u3083 ''{1}'' \u306b\u3088\u3063\u3066\u6307\u5b9a\u3057\u3083\u308c\u305f\u304a\uff9e\u3049\u304a\u30a9\u304a\u3093\u3077\u3057\u3087\u3093\u540d ''{0}'' \u304c\u4e0d\u6b63\u308c\u3057\u3085\u3045\u3045\u3045
compiler.err.proc.processor.cant.instantiate=\u3077\u308d\u305b\u3063\u3057\u3083 ''{0}'' \u306e\u3049\u304a\u304a\u3044\u3043\u3093\u3057\u3085\u305f\u3093\u3057\u3085\u3092\u3044\u3043\u3093\u3057\u3085\u305f\u3093\u3057\u3085\u5316\u308c\u304d\u307e\u305b\u3093\u308c\u3057\u305f\u306e\u3049\u304a\u304a
compiler.err.proc.processor.constructor.error=\u3077\u308d\u305b\u3063\u3057\u3083\u304a\uff9e\u3049\u304a\u30a9\u304a\u3093\u3076\u3058\u3047\u304f\u3068\u306e\u3049\u304a\u304a\u69cb\u7bc9\u4e2d\u306b\u4f8b\u5916\u304c\u3057\u3085\u308d\u30fc\u3057\u3083\u308c\u307e\u3057\u305f: {0}
compiler.err.proc.processor.not.found=\u6ce8\u91c8\u3077\u308d\u305b\u3063\u3057\u3083 ''{0}'' \u304c\u898b\u3061\u3085\u304b\u308a\u307e\u305b\u3093
compiler.err.proc.processor.wrong.type=\u6ce8\u91c8\u3077\u308d\u305b\u3063\u3057\u3083 ''{0}'' \u304c javax.annotation.processing.Processor \u3092\u5b9f\u88c5\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u3044\u3043\u307e\u305b\u3093
compiler.err.qualified.new.of.static.class=static \u304f\u3089\u3057\u3085\u306e\u3049\u304a\u304a new \u304c\u4fee\u98fe\u3057\u3083\u308c\u3066\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.recursive.ctor.invocation=\u3053\u3093\u3057\u3085\u3068\u3089\u304f\u305f\u306e\u3049\u304a\u304a\u547c\u3073\u51fa\u3057\u304c\u518d\u5e30\u7684\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.ref.ambiguous={0} \u306e\u3049\u304a\u304a\u53c2\u7167\u306f\u3041\u3042\u3042\u3042 \u3042\u3049\u3044\u3043\u307e\u3044\u3043\u308c\u3057\u3085\u3045\u3045\u3045\u3002{3} \u306e\u3049\u304a\u304a {1} {2} \u3068 {6} \u306e\u3049\u304a\u304a {4} {5} \u304c\u4e21\u65b9\u9069\u5408\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3002
compiler.err.repeated.annotation.target=\u6ce8\u91c8\u305f\u30fc\u3052\u3063\u3068\u304c\u7e70\u308a\u8fd4\u3057\u3083\u308c\u3066\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.repeated.interface=\u3044\u3043\u3093\u305f\u3075\u3047\u30fc\u3057\u3085\u304c\u7e70\u308a\u8fd4\u3057\u3083\u308c\u3066\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.repeated.modifier=\u4fee\u98fe\u5b50\u304c\u7e70\u308a\u8fd4\u3057\u3083\u308c\u3066\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.report.access={0} \u306f {2} \u308c {1} \u3041\u3042\u3042\u3042 \u3042\u3049\u304f\u305b\u3057\u3085\u3057\u3083\u308c\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.ret.outside.meth=\u3081\u305d\u3063\u3069\u306e\u3049\u304a\u304a\u5916\u306e\u3049\u304a\u304a return \u6587\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.signature.doesnt.match.intf=\u3057\u3050\u306b\u3072\u3083\u30fc\u304c {0} \u306b\u9069\u5408\u3057\u307e\u305b\u3093\u3002\u4e92\u63db\u6027\u306e\u3049\u304a\u304a\u306b\u3083\u3044\u3043\u3043\u3043\u3063\u3088\u3049\u304a\u304a\uff9e\u3093\u305f\u3075\u3047\u30fc\u3057\u3085\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.signature.doesnt.match.supertype=\u3057\u3050\u306b\u3072\u3083\u30fc\u304c {0} \u306b\u9069\u5408\u3057\u307e\u305b\u3093\u3002\u4e92\u63db\u6027\u306e\u3049\u304a\u304a\u306b\u3083\u3044\u3043\u3057\u3085\u30fc\u3071\u30fc\u305f\u3044\u3043\u3077\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.source.cant.overwrite.input.file=\u305d\u30fc\u3057\u3085\u306e\u3049\u304a\u304a\u66f8\u304d\u8fbc\u307f\u3048\u3089\u30fc\u308c\u3057\u3085\u3045\u3045\u3045\u3002\u5165\u529b\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b\u306e\u3049\u304a\u304a {0} \u3092\u4e0a\u66f8\u304d\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.stack.sim.error=\u5185\u90e8\u3048\u3089\u30fc: {0} \u308c\u306e\u3049\u304a\u304a\u3057\u3085\u305f\u3063\u304f\u3057\u307f\u3085\u308c\u30fc\u3057\u3087\u3093\u3048\u3089\u30fc
compiler.err.static.imp.only.classes.and.interfaces=static import \u306f\u304f\u3089\u3057\u3085\u3068\u3044\u3043\u3093\u305f\u3075\u3047\u30fc\u3057\u3085\u304b\u3089\u306e\u3049\u304a\u304a\u307f\u3068\u306b\u3083\u308a\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.static.import.not.supported.in.source=static import \u5ba3\u8a00\u306f -source {0} \u308c\u3057\u3083\u307d\u30fc\u3068\u3057\u3083\u308c\u3066\u3044\u3043\u307e\u305b\u3093<br>(static import \u5ba3\u8a00\u3092\u4f7f\u7528\u53ef\u80fd\u306b\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u306b\u306f\u3001-source 5 \u4ee5\u964d\u3092\u4f7f\u7528\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u304f\u3089\u3057\u3083\u3044\u3043)
compiler.err.synthetic.name.conflict=\u3057\u3093\u307c\u308b\u306e\u3049\u304a\u304a {0} \u304c\u3001{1} \u308c\u3053\u3093\u3071\u3044\u3043\u3089\u304c\u5408\u6210\u3057\u305f\u3057\u3093\u307c\u308b\u3068\u7af6\u5408\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3002
compiler.err.throws.not.allowed.in.intf.annotation=throws \u7bc0\u3092 @interface \u3081\u3093\u3070\u308c\u4f7f\u7528\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3053\u3068\u306f\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.try.without.catch.or.finally=''try'' \u3078\u306e\u3049\u304a\u304a ''catch'' \u307e\u305f\u306f ''finally'' \u304c\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u305b\u3093\u3002
compiler.err.type.doesnt.take.params=\u578b {0} \u306f\u3071\u3089\u3081\u30fc\u305f\u3092\u3068\u308a\u307e\u305b\u3093\u3002
compiler.err.type.found.req=\u4e88\u671f\u3057\u306b\u3083\u3044\u3043\u578b<br>\u691c\u51fa\u5024  : {0}<br>\u671f\u5f85\u5024  : {1}
compiler.err.type.var.cant.be.deref=\u578b\u5909\u6570\u304b\u3089\u9078\u629e\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.type.var.may.not.be.followed.by.other.bounds=\u3053\u306e\u3049\u304a\u304a\u578b\u5909\u6570\u306e\u3049\u304a\u304a\u5f8c\u308d\u306b\u4ed6\u306e\u3049\u304a\u304a\u5883\u754c\u3092\u914d\u7f6e\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3053\u3068\u306f\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.type.var.more.than.once=\u578b\u5909\u6570 {0} \u306f {1} \u306e\u3049\u304a\u304a\u623b\u308a\u5024\u306e\u3049\u304a\u304a\u578b\u308c 2 \u56de\u4ee5\u4e0a\u51fa\u73fe\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3002\u3044\u3043\u3093\u3057\u3085\u305f\u3093\u3057\u3085\u751f\u6210\u3057\u3083\u308c\u306b\u3083\u3044\u3043\u307e\u307e\u306b\u306f\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.type.var.more.than.once.in.result=\u578b\u5909\u6570 {0} \u306f {1} \u306e\u3049\u304a\u304a\u578b\u308c 2 \u56de\u4ee5\u4e0a\u51fa\u73fe\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3002\u3044\u3043\u3093\u3057\u3085\u305f\u3093\u3057\u3085\u751f\u6210\u3057\u3083\u308c\u306b\u3083\u3044\u3043\u307e\u307e\u306b\u306f\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.types.incompatible.diff.ret=\u578b {0} \u3068\u578b {1} \u306e\u3049\u304a\u304a\u4e92\u63db\u6027\u304c\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u305b\u3093\u3002\u4e21\u65b9\u3068\u3082 {2} \u3092\u5b9a\u7fa9\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u304c\u3001\u623b\u308a\u5024\u306e\u3049\u304a\u304a\u578b\u304c\u7121\u95a2\u4fc2\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.unclosed.char.lit=\u6587\u5b57\u308a\u3066\u3089\u308b\u304c\u9589\u3058\u3089\u308c\u3066\u3044\u3043\u307e\u305b\u3093\u3002
compiler.err.unclosed.comment=\u3053\u3081\u3093\u3068\u304c\u9589\u3058\u3089\u308c\u3066\u3044\u3043\u307e\u305b\u3093\u3002
compiler.err.unclosed.str.lit=\u6587\u5b57\u5217\u308a\u3066\u3089\u308b\u304c\u9589\u3058\u3089\u308c\u3066\u3044\u3043\u307e\u305b\u3093\u3002
compiler.err.undef.label=\u3089\u3079\u308b\u306e\u3049\u304a\u304a {0} \u306f\u672a\u5b9a\u7fa9\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.undetermined.type={0} \u306e\u3049\u304a\u304a\u578b\u3071\u3089\u3081\u30fc\u305f\u3092\u5224\u5225\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.undetermined.type.1=\u578b\u3071\u3089\u3081\u30fc\u305f\u306e\u3049\u304a\u304a {0} \u3092\u5224\u5225\u308c\u304d\u307e\u305b\u3093; {1}
compiler.err.unexpected.type=\u4e88\u671f\u3057\u306b\u3083\u3044\u3043\u578b<br>\u671f\u5f85\u5024  : {0}<br>\u691c\u51fa\u5024  : {1}
compiler.err.unknown.enum.constant=\u304f\u3089\u3057\u3085\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b\u306e\u3049\u304a\u304a {0} \u5185: \u4e0d\u660e\u306b\u3083\u5217\u6319\u578b\u5b9a\u6570\u308c\u3057\u3085\u3045\u3045\u3045 {1}.{2}
compiler.err.unreachable.stmt=\u3053\u306e\u3049\u304a\u304a\u6587\u306b\u5236\u5fa1\u304c\u79fb\u308b\u3053\u3068\u306f\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u305b\u3093\u3002
compiler.err.unreported.exception.default.constructor=\u308c\u3075\u3049\u308b\u3068\u306e\u3049\u304a\u304a\u3053\u3093\u3057\u3085\u3068\u3089\u304f\u305f\u5185\u306b\u5831\u544a\u3057\u3083\u308c\u306b\u3083\u3044\u3043\u4f8b\u5916 {0} \u304c\u5b58\u5728\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3002
compiler.err.unreported.exception.need.to.catch.or.throw=\u4f8b\u5916 {0} \u306f\u5831\u544a\u3057\u3083\u308c\u307e\u305b\u3093\u3002\u3057\u3085\u308d\u30fc\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u306b\u306f\u304d\u3083\u3063\u3061\u307e\u305f\u306f\u3001\u3057\u3085\u308d\u30fc\u5ba3\u8a00\u3092\u3057\u306b\u3083\u3051\u308c\u3070\u306b\u3083\u308a\u307e\u305b\u3093\u3002
compiler.err.unsupported.cross.fp.lit=16 \u9032\u6d6e\u52d5\u5c0f\u6570\u70b9\u308a\u3066\u3089\u308b\u306f\u3053\u306e\u3049\u304a\u304a VM \u308c\u306f\u3057\u3083\u307d\u30fc\u3068\u3057\u3083\u308c\u3066\u3044\u3043\u307e\u305b\u3093\u3002
compiler.err.unsupported.encoding=\u3057\u3083\u307d\u30fc\u3068\u3057\u3083\u308c\u3066\u3044\u3043\u306b\u3083\u3044\u3043\u3048\u3093\u3053\u30fc\u308c\u3043\u3093\u3050\u308c\u3057\u3085\u3045\u3045\u3045: {0}
compiler.err.unsupported.fp.lit=16 \u9032\u6d6e\u52d5\u5c0f\u6570\u70b9\u308a\u3066\u3089\u308b\u306f -source 5 \u3088\u308a\u524d\u308c\u306f\u3057\u3083\u307d\u30fc\u3068\u3057\u3083\u308c\u3066\u3044\u3043\u307e\u305b\u3093
compiler.err.var.might.already.be.assigned=\u5909\u6570 {0} \u306f\u3057\u3085\u308c\u306b\u4ee3\u5165\u3057\u3083\u308c\u3066\u3044\u3043\u308b\u53ef\u80fd\u6027\u304c\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.var.might.be.assigned.in.loop=\u5909\u6570 {0} \u306f\u308b\u30fc\u3077\u5185\u308c\u4ee3\u5165\u3057\u3083\u308c\u3066\u3044\u3043\u308b\u53ef\u80fd\u6027\u304c\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.var.might.not.have.been.initialized=\u5909\u6570 {0} \u306f\u521d\u671f\u5316\u3057\u3083\u308c\u3066\u3044\u3043\u306b\u3083\u3044\u3043\u53ef\u80fd\u6027\u304c\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.err.varargs.not.supported.in.source=\u53ef\u5909\u5f15\u6570\u3081\u305d\u3063\u3069\u306f -source {0} \u308c\u3057\u3083\u307d\u30fc\u3068\u3057\u3083\u308c\u3066\u3044\u3043\u307e\u305b\u3093<br>(\u53ef\u5909\u5f15\u6570\u3081\u305d\u3063\u3069\u3092\u4f7f\u7528\u53ef\u80fd\u306b\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u306b\u306f\u3001-source 5 \u4ee5\u964d\u3092\u4f7f\u7528\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u304f\u3089\u3057\u3083\u3044\u3043)
compiler.err.void.not.allowed.here=\u3053\u3053\u308c ''void'' \u578b\u3092\u4f7f\u7528\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3053\u3068\u306f\u308c\u304d\u307e\u305b\u3093\u3002
compiler.err.wrong.number.type.args=\u578b\u5f15\u6570\u306e\u3049\u304a\u304a\u6570\u304c\u4e0d\u6b63\u308c\u3057\u3085\u3045\u3045\u3045\u3002{0} \u500b\u5fc5\u8981\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.misc.anonymous.class=<anonymous {0}>
compiler.misc.arg.length.mismatch=\u5b9f\u5f15\u6570\u308a\u3057\u3085\u3068\u3068\u4eee\u5f15\u6570\u308a\u3057\u3085\u3068\u306e\u3049\u304a\u304a\u9577\u3057\u3083\u304c\u7570\u306b\u3083\u308b\u305f\u3081\u3001\u5f15\u6570\u304b\u3089\u3044\u3043\u3093\u3057\u3085\u305f\u3093\u3057\u3085\u3092\u4f5c\u6210\u308c\u304d\u307e\u305b\u3093\u3002
compiler.misc.assignment.from.super-bound=\u3057\u3085\u30fc\u3071\u30fc\u3070\u3046\u3093\u3069\u578b {0} \u304b\u3089\u306e\u3049\u304a\u304a\u4ee3\u5165
compiler.misc.assignment.to.extends-bound=\u62e1\u5f35\u3070\u3046\u3093\u3069\u578b {0} \u3078\u306e\u3049\u304a\u304a\u4ee3\u5165
compiler.misc.bad.class.file.header=\u304f\u3089\u3057\u3085\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b\u306e\u3049\u304a\u304a {0} \u306f\u4e0d\u6b63\u308c\u3057\u3085\u3045\u3045\u3045\u3002<br>{1}<br>\u524a\u9664\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u304b\u3001\u304f\u3089\u3057\u3085\u3071\u3057\u3085\u306e\u3049\u304a\u304a\u6b63\u3057\u3044\u3043\u3057\u3083\u3076\u308c\u3043\u308c\u304f\u3068\u308a\u306b\u3041\u3042\u3042\u3042 \u3042\u3049\u308b\u304b\u3092\u78ba\u8a8d\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u304f\u3089\u3057\u3083\u3044\u3043\u306b\u3083\u306e\u3049\u304a\u304a\u3002
compiler.misc.bad.class.signature=\u304f\u3089\u3057\u3085 {0} \u306e\u3049\u304a\u304a\u3057\u3050\u306b\u3072\u3083\u30fc\u304c\u4e0d\u6b63\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.misc.bad.const.pool.tag=\u5b9a\u6570\u3077\u30fc\u308b\u305f\u3050 {0} \u304c\u4e0d\u6b63\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.misc.bad.const.pool.tag.at=\u5b9a\u6570\u3077\u30fc\u308b\u305f\u3050 {1} \u308c\u306e\u3049\u304a\u304a {0} \u304c\u4e0d\u6b63\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.misc.bad.enclosing.method=\u56f2\u3093\u308c\u3044\u3043\u308b\u3081\u305d\u3063\u3069\u5c5e\u6027\u304c\u4e0d\u6b63\u308c\u3057\u3085\u3045\u3045\u3045: {0}
compiler.misc.bad.runtime.invisible.param.annotations=RuntimeInvisibleParameterAnnotations \u5c5e\u6027\u304c\u4e0d\u6b63\u308c\u3057\u3085\u3045\u3045\u3045: {0}
compiler.misc.bad.signature=\u3057\u3050\u306b\u3072\u3083\u30fc {0} \u304c\u4e0d\u6b63\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.misc.base.membership=\u3057\u3085\u3079\u3066\u306e\u3049\u304a\u304a\u57fa\u5e95\u304f\u3089\u3057\u3085\u304c\u3001\u3081\u3093\u3070\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.misc.cant.implement={1} \u306e\u3049\u304a\u304a {0} \u306f {3} \u306e\u3049\u304a\u304a {2} \u3092\u5b9f\u88c5\u308c\u304d\u307e\u305b\u3093\u3002
compiler.misc.cant.override={1} \u306e\u3049\u304a\u304a {0} \u306f {3} \u306e\u3049\u304a\u304a {2} \u3092\u304a\uff9e\u3049\u304a\u30a9\u304a\u3093\u30fc\u3070\u30fc\u3089\u3044\u3043\u3069\u308c\u304d\u307e\u305b\u3093\u3002
compiler.misc.ccf.found.later.version=\u304f\u3089\u3057\u3085\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b\u306e\u3049\u304a\u304a {0} \u306b\u4e88\u60f3\u5916\u306e\u3049\u304a\u304a\u65b0\u3070\u30fc\u3058\u3087\u3093\u304c\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.misc.ccf.unrecognized.attribute={0} \u306f\u8a8d\u8b58\u3057\u3083\u308c\u306b\u3083\u3044\u3043\u5c5e\u6027\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.misc.clashes.with={1} \u306e\u3049\u304a\u304a {0} \u306f {3} \u306e\u3049\u304a\u304a {2} \u3068\u7af6\u5408\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3002
compiler.misc.class.file.not.found={0} \u306e\u3049\u304a\u304a\u304f\u3089\u3057\u3085\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b\u304c\u898b\u3061\u3085\u304b\u308a\u307e\u305b\u3093
compiler.misc.class.file.wrong.class=\u304f\u3089\u3057\u3085\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b\u306e\u3049\u304a\u304a {0} \u306b\u4e0d\u6b63\u306b\u3083\u304f\u3089\u3057\u3085\u304c\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.misc.count.error=\u3048\u3089\u30fc {0} \u500b
compiler.misc.count.error.plural=\u3048\u3089\u30fc {0} \u500b
compiler.misc.count.warn=\u8b66\u544a {0} \u500b
compiler.misc.count.warn.plural=\u8b66\u544a {0} \u500b
compiler.misc.fatal.err.cant.locate.ctor=\u81f4\u547d\u7684\u3048\u3089\u30fc: {0} \u306e\u3049\u304a\u304a\u3053\u3093\u3057\u3085\u3068\u3089\u304f\u305f\u3092\u691c\u51fa\u308c\u304d\u307e\u305b\u3093\u3002
compiler.misc.fatal.err.cant.locate.field=\u81f4\u547d\u7684\u3048\u3089\u30fc: \u3075\u3043\u30fc\u308b\u3069 {0} \u3092\u691c\u51fa\u308c\u304d\u307e\u305b\u3093\u3002
compiler.misc.fatal.err.cant.locate.meth=\u81f4\u547d\u7684\u3048\u3089\u30fc: \u3081\u305d\u3063\u3069 {0} \u3092\u691c\u51fa\u308c\u304d\u307e\u305b\u3093\u3002
compiler.misc.fatal.err.no.java.lang=\u81f4\u547d\u7684\u3048\u3089\u30fc: \u304f\u3089\u3057\u3085\u3071\u3057\u3085\u307e\u305f\u306f\u3076\u30fc\u3068\u304f\u3089\u3057\u3085\u3071\u3057\u3085\u308c\u3071\u3063\u3051\u30fc\u3058 java.lang \u3092\u691c\u51fa\u308c\u304d\u307e\u305b\u3093\u3002
compiler.misc.file.does.not.contain.package=\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b\u306b\u3071\u3063\u3051\u30fc\u3058 {0} \u304c\u542b\u307e\u308c\u3066\u3044\u3043\u307e\u305b\u3093
compiler.misc.file.doesnt.contain.class=\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b\u306b\u304f\u3089\u3057\u3085 {0} \u304c\u542b\u307e\u308c\u3066\u3044\u3043\u307e\u305b\u3093\u3002
compiler.misc.illegal.start.of.class.file=\u304f\u3089\u3057\u3085\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b\u306e\u3049\u304a\u304a\u958b\u59cb\u304c\u4e0d\u6b63\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.misc.incompatible.types=\u4e92\u63db\u6027\u306e\u3049\u304a\u304a\u306b\u3083\u3044\u3043\u578b
compiler.misc.incompatible.types.1=\u4e92\u63db\u6027\u306e\u3049\u304a\u304a\u306b\u3083\u3044\u3043\u578b; {0}
compiler.misc.inconvertible.types=\u5909\u63db\u308c\u304d\u306b\u3083\u3044\u3043\u578b
compiler.misc.inferred.do.not.conform.to.bounds=\u63a8\u5b9a\u578b\u5f15\u6570 {0} \u306f\u578b\u5909\u6570 {1} \u306e\u3049\u304a\u304a\u5883\u754c\u306b\u9069\u5408\u3057\u307e\u305b\u3093\u3002
compiler.misc.kindname=\u8b58\u5225\u5b50 ({0})
compiler.misc.kindname.annotation=@\u3044\u3043\u3093\u305f\u3075\u3047\u30fc\u3057\u3085
compiler.misc.kindname.class=\u304f\u3089\u3057\u3085
compiler.misc.kindname.class.package=\u304f\u3089\u3057\u3085\u3001\u3071\u3063\u3051\u30fc\u3058
compiler.misc.kindname.constructor=\u3053\u3093\u3057\u3085\u3068\u3089\u304f\u305f\u306e\u3049\u304a\u304a
compiler.misc.kindname.interface=\u3044\u3043\u3093\u305f\u3075\u3047\u30fc\u3057\u3085
compiler.misc.kindname.method=\u3081\u305d\u3063\u3069
compiler.misc.kindname.method.class=\u3081\u305d\u3063\u3069\u3001\u304f\u3089\u3057\u3085
compiler.misc.kindname.method.class.package=\u3081\u305d\u3063\u3069\u3001\u304f\u3089\u3057\u3085\u3001\u3071\u3063\u3051\u30fc\u3058
compiler.misc.kindname.method.package=\u3081\u305d\u3063\u3069\u3001\u3071\u3063\u3051\u30fc\u3058
compiler.misc.kindname.package=\u3071\u3063\u3051\u30fc\u3058
compiler.misc.kindname.static=static
compiler.misc.kindname.type.variable=\u578b\u5909\u6570\u306e\u3049\u304a\u304a\u5883\u754c
compiler.misc.kindname.value=\u5024
compiler.misc.kindname.value.class=\u5024\u3001\u304f\u3089\u3057\u3085
compiler.misc.kindname.value.class.package=\u5024\u3001\u304f\u3089\u3057\u3085\u3001\u3071\u3063\u3051\u30fc\u3058
compiler.misc.kindname.value.method=\u5024\u3001\u3081\u305d\u3063\u3069
compiler.misc.kindname.value.method.class=\u5024\u3001\u3081\u305d\u3063\u3069\u3001\u304f\u3089\u3057\u3085
compiler.misc.kindname.value.method.class.package=\u5024\u3001\u3081\u305d\u3063\u3069\u3001\u304f\u3089\u3057\u3085\u3001\u3071\u3063\u3051\u30fc\u3058
compiler.misc.kindname.value.method.package=\u5024\u3001\u3081\u305d\u3063\u3069\u3001\u3071\u3063\u3051\u30fc\u3058
compiler.misc.kindname.value.package=\u5024\u3001\u3071\u3063\u3051\u30fc\u3058
compiler.misc.kindname.variable=\u5909\u6570
compiler.misc.kindname.variable.class=\u5909\u6570\u3001\u304f\u3089\u3057\u3085
compiler.misc.kindname.variable.class.package=\u5909\u6570\u3001\u304f\u3089\u3057\u3085\u3001\u3071\u3063\u3051\u30fc\u3058
compiler.misc.kindname.variable.method=\u5909\u6570\u3001\u3081\u305d\u3063\u3069
compiler.misc.kindname.variable.method.class=\u5909\u6570\u3001\u3081\u305d\u3063\u3069\u3001\u304f\u3089\u3057\u3085
compiler.misc.kindname.variable.method.class.package=\u5909\u6570\u3001\u3081\u305d\u3063\u3069\u3001\u304f\u3089\u3057\u3085\u3001\u3071\u3063\u3051\u30fc\u3058
compiler.misc.kindname.variable.method.package=\u5909\u6570\u3001\u3081\u305d\u3063\u3069\u3001\u3071\u3063\u3051\u30fc\u3058
compiler.misc.kindname.variable.package=\u5909\u6570\u3001\u3071\u3063\u3051\u30fc\u3058
compiler.misc.no.conforming.assignment.exists=\u578b\u5909\u6570 {0} \u306e\u3049\u304a\u304a\u3044\u3043\u3093\u3057\u3085\u305f\u3093\u3057\u3085\u304c\u5b58\u5728\u3057\u306b\u3083\u3044\u3043\u306e\u3049\u304a\u304a\u308c\u3001\u5f15\u6570\u578b {1} \u306f\u4eee\u3071\u3089\u3081\u30fc\u305f\u578b {2} \u306b\u9069\u5408\u3057\u307e\u305b\u3093\u3002
compiler.misc.no.conforming.instance.exists=\u578b\u5909\u6570 {0} \u306e\u3049\u304a\u304a\u3044\u3043\u3093\u3057\u3085\u305f\u3093\u3057\u3085\u304c\u5b58\u5728\u3057\u306b\u3083\u3044\u3043\u306e\u3049\u304a\u304a\u308c\u3001{1} \u306f {2} \u306b\u9069\u5408\u3057\u307e\u305b\u3093\u3002
compiler.misc.no.unique.maximal.instance.exists=\u578b\u5909\u6570 {0} (\u4e0a\u9650 {1}) \u306e\u3049\u304a\u304a\u56fa\u6709\u306e\u3049\u304a\u304a\u6700\u5927\u3044\u3043\u3093\u3057\u3085\u305f\u3093\u3057\u3085\u304c\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
compiler.misc.no.unique.minimal.instance.exists=\u578b\u5909\u6570 {0} (\u4e0b\u9650 {1}) \u306e\u3049\u304a\u304a\u56fa\u6709\u306e\u3049\u304a\u304a\u6700\u5c0f\u3044\u3043\u3093\u3057\u3085\u305f\u3093\u3057\u3085\u304c\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
compiler.misc.override.incompatible.ret={0}\u4e92\u63db\u6027\u306e\u3049\u304a\u304a\u306b\u3083\u3044\u3043\u623b\u308a\u5024\u306e\u3049\u304a\u304a\u578b\u3092\u4f7f\u304a\uff9e\u3049\u304a\u30a9\u304a\u3093\u3046\u3068\u3057\u307e\u3057\u305f\u306e\u3049\u304a\u304a\u3002
compiler.misc.override.unchecked.ret={0}; \u623b\u308a\u5024\u306e\u3049\u304a\u304a\u578b\u306f\u7121\u691c\u67fb\u5909\u63db\u304c\u5fc5\u8981\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.misc.possible.loss.of.precision=\u7cbe\u5ea6\u304c\u843d\u3061\u3066\u3044\u3043\u308b\u53ef\u80fd\u6027
compiler.misc.resume.abort=R)\u518d\u958b, A)\u4e2d\u6b62>
compiler.misc.source.unavailable=(\u305d\u30fc\u3057\u3085\u304c\u5229\u7528\u4e0d\u53ef)
compiler.misc.token.bad-symbol=<bad symbol>
compiler.misc.token.character=<character>
compiler.misc.token.double=<double>
compiler.misc.token.end-of-input=<end of input>
compiler.misc.token.float=<float>
compiler.misc.token.identifier=<identifier>
compiler.misc.token.integer=<integer>
compiler.misc.token.long-integer=<long integer>
compiler.misc.token.string=<string>
compiler.misc.type.parameter=\u578b\u3071\u3089\u3081\u30fc\u305f\u306e\u3049\u304a\u304a {0} 
compiler.misc.type.req.class=\u304f\u3089\u3057\u3085
compiler.misc.type.req.class.array=\u304f\u3089\u3057\u3085\u307e\u305f\u306f\u914d\u5217
compiler.misc.type.req.exact=\u5883\u754c\u306e\u3049\u304a\u304a\u306b\u3083\u30a4\u3063\u304f\u3045\u3045\u3075\u3045\u3093\u3089\u3057\u3085\u307e\u305f\u306f\u3072\u3043\u3093\u305f\u3075\u3047\u30fc\u3057\u3085
compiler.misc.type.req.ref=\u53c2\u7167
compiler.misc.unable.to.access.file=\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b\u306e\u3049\u304a\u304a {0} \u306b\u3041\u3042\u3042\u3042 \u3042\u3049\u304f\u305b\u3057\u3085\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3053\u3068\u304c\u308c\u304d\u307e\u305b\u3093\u3002
compiler.misc.unchecked.assign=[unchecked] \u7121\u691c\u67fb\u5909\u63db\u308c\u3057\u3085\u3045\u3045\u3045
compiler.misc.unchecked.cast.to.type=[unchecked] \u7121\u691c\u67fb\u304d\u3083\u3057\u3085\u3068\u308c\u3057\u3085\u3045\u3045\u3045
compiler.misc.unchecked.clash.with={1} \u306e\u3049\u304a\u304a {0} \u306f {3} \u306e\u3049\u304a\u304a {2} \u3092\u304a\uff9e\u3049\u304a\u30a9\u304a\u3093\u30fc\u3070\u30fc\u3089\u3044\u3043\u3069\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3002
compiler.misc.unchecked.implement={1} \u306e\u3049\u304a\u304a {0} \u306f {3} \u306e\u3049\u304a\u304a {2} \u3092\u5b9f\u88c5\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3002
compiler.misc.unchecked.override={1} \u306e\u3049\u304a\u304a {0} \u306f {3} \u306e\u3049\u304a\u304a {2} \u3092\u4e0a\u66f8\u304d\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3002
compiler.misc.undecl.type.var=\u578b\u5909\u6570 {0} \u306f\u5ba3\u8a00\u3057\u3083\u308c\u3066\u3044\u3043\u307e\u305b\u3093\u3002
compiler.misc.undetermined.type=\u672a\u5b9a\u578b
compiler.misc.unicode.str.not.supported=\u304f\u3089\u3057\u3085\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b\u5185\u306e\u3049\u304a\u304a Unicode \u6587\u5b57\u5217\u306f\u3057\u3083\u307d\u30fc\u3068\u3057\u3083\u308c\u3066\u3044\u3043\u307e\u305b\u3093\u3002
compiler.misc.varargs.clash.with={1} \u306e\u3049\u304a\u304a {0} \u306f {3} \u306e\u3049\u304a\u304a {2} \u3092\u4e0a\u66f8\u304d\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3002
compiler.misc.varargs.implement={1} \u306e\u3049\u304a\u304a {0} \u306f {3} \u306e\u3049\u304a\u304a {2} \u3092\u5b9f\u88c5\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3002
compiler.misc.varargs.override={1} \u306e\u3049\u304a\u304a {0} \u306f {3} \u306e\u3049\u304a\u304a {2} \u3092\u4e0a\u66f8\u304d\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3002
compiler.misc.verbose.checking.attribution=[{0} \u3092\u78ba\u8a8d\u4e2d]
compiler.misc.verbose.classpath=[\u304f\u3089\u3057\u3085\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b\u306e\u3049\u304a\u304a\u691c\u7d22\u3071\u3057\u3085: {0}]
compiler.misc.verbose.loading=[{0} \u3092\u8aad\u307f\u8fbc\u307f\u4e2d]
compiler.misc.verbose.parsing.done=[{0}ms \u308c\u69cb\u6587\u89e3\u6790\u5b8c\u4e86]
compiler.misc.verbose.parsing.started=[{0} \u3092\u69cb\u6587\u89e3\u6790\u958b\u59cb]
compiler.misc.verbose.retro=[{0} \u3092\u7d44\u307f\u66ff\u3048\u4e2d]
compiler.misc.verbose.retro.with={0} \u3092 {1} \u308c\u7d44\u307f\u66ff\u3048\u4e2d\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.misc.verbose.retro.with.list={0} \u3092\u578b\u3071\u3089\u3081\u30fc\u305f\u306e\u3049\u304a\u304a {1}\u3001\u3057\u3085\u30fc\u3071\u30fc\u305f\u3044\u3043\u3077 {2}\u3001\u3044\u3043\u3093\u305f\u3075\u3047\u30fc\u3057\u3085 {3} \u308c\u7d44\u307f\u66ff\u3048\u4e2d\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.misc.verbose.sourcepath=[\u305d\u30fc\u3057\u3085\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b\u306e\u3049\u304a\u304a\u691c\u7d22\u3071\u3057\u3085: {0}]
compiler.misc.verbose.total=[\u5408\u8a08 {0}ms]
compiler.misc.verbose.wrote.file=[{0} \u3092\u66f8\u304d\u8fbc\u307f\u5b8c\u4e86]
compiler.misc.wrong.version=\u304f\u3089\u3057\u3085\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b\u306e\u3049\u304a\u304a\u3070\u30fc\u3058\u3087\u3093 {0}.{1} \u306f\u4e0d\u6b63\u308c\u3057\u3085\u3045\u3045\u3045\u3002{2}.{3} \u308c\u3041\u3042\u3042\u3042 \u3042\u3049\u308b\u3079\u304d\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.misc.x.print.processor.info=\u3077\u308d\u305b\u3063\u3057\u3083 {0} \u306f {1} \u306b\u4e00\u81f4\u3057\u3001{2} \u3092\u8fd4\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3002
compiler.misc.x.print.rounds=\u5f80\u5fa9 {0}:<br>	\u5165\u529b\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b: {1}<br>	\u6ce8\u91c8: {2}<br>	\u6700\u5f8c\u306e\u3049\u304a\u304a\u5f80\u5fa9: {3}
compiler.note.deprecated.filename={0} \u306f\u63a8\u5968\u3057\u3083\u308c\u306b\u3083\u3044\u3043\u306e\u3049\u304a\u304a API \u3092\u4f7f\u7528\u307e\u305f\u306f\u304a\uff9e\u3049\u304a\u30a9\u304a\u3093\u30fc\u3070\u30fc\u3089\u3044\u3043\u3069\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.note.deprecated.filename.additional={0} \u306b\u63a8\u5968\u3057\u3083\u308c\u306b\u3083\u3044\u3043\u306e\u3049\u304a\u304a API \u306e\u3049\u304a\u304a\u8ffd\u52a0\u4f7f\u7528\u307e\u305f\u306f\u304a\uff9e\u3049\u304a\u30a9\u304a\u3093\u30fc\u3070\u30fc\u3089\u3044\u3043\u3069\u304c\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.note.deprecated.plural=\u4e00\u90e8\u306e\u3049\u304a\u304a\u5165\u529b\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b\u306f\u63a8\u5968\u3057\u3083\u308c\u306b\u3083\u3044\u3043\u306e\u3049\u304a\u304a API \u3092\u4f7f\u7528\u307e\u305f\u306f\u304a\uff9e\u3049\u304a\u30a9\u304a\u3093\u30fc\u3070\u30fc\u3089\u3044\u3043\u3069\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.note.deprecated.plural.additional=\u4e00\u90e8\u306e\u3049\u304a\u304a\u5165\u529b\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b\u306f\u63a8\u5968\u3057\u3083\u308c\u306b\u3083\u3044\u3043\u306e\u3049\u304a\u304a API \u3092\u8ffd\u52a0\u4f7f\u7528\u307e\u305f\u306f\u304a\uff9e\u3049\u304a\u30a9\u304a\u3093\u30fc\u3070\u30fc\u3089\u3044\u3043\u3069\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.note.deprecated.recompile=\u8a73\u7d30\u306b\u3061\u3085\u3044\u3043\u3066\u306f\u3001-Xlint:deprecation \u304a\uff9e\u3049\u304a\u30a9\u304a\u3093\u3077\u3057\u3087\u3093\u3092\u6307\u5b9a\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u518d\u3053\u3093\u3071\u3044\u3043\u308b\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u304f\u3089\u3057\u3083\u3044\u3043\u306b\u3083\u306e\u3049\u304a\u304a\u3002
compiler.note.note=\u6ce8:
compiler.note.proc.messager={0}
compiler.note.unchecked.filename={0} \u306e\u3049\u304a\u304a\u64cd\u4f5c\u306f\u3001\u672a\u3061\u3047\u3063\u304f\u307e\u305f\u306f\u5b89\u5168\u308c\u306f\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u305b\u3093\u3002
compiler.note.unchecked.filename.additional={0} \u306b\u672a\u3061\u3047\u3063\u304f\u307e\u305f\u306f\u5b89\u5168\u308c\u306f\u306b\u3083\u3044\u3043\u64cd\u4f5c\u304c\u3057\u3083\u3089\u306b\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.note.unchecked.plural=\u5165\u529b\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b\u306e\u3049\u304a\u304a\u64cd\u4f5c\u306e\u3049\u304a\u304a\u3046\u3061\u3001\u672a\u3061\u3047\u3063\u304f\u307e\u305f\u306f\u5b89\u5168\u308c\u306f\u306b\u3083\u3044\u3043\u3082\u306e\u3049\u304a\u304a\u304c\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.note.unchecked.plural.additional=\u5165\u529b\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b\u306e\u3049\u304a\u304a\u64cd\u4f5c\u306e\u3049\u304a\u304a\u3046\u3061\u3001\u672a\u3061\u3047\u3063\u304f\u307e\u305f\u306f\u5b89\u5168\u308c\u306f\u306b\u3083\u3044\u3043\u3082\u306e\u3049\u304a\u304a\u304c\u3057\u3083\u3089\u306b\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.note.unchecked.recompile=\u8a73\u7d30\u306b\u3061\u3085\u3044\u3043\u3066\u306f\u3001-Xlint:unchecked \u304a\uff9e\u3049\u304a\u30a9\u304a\u3093\u3077\u3057\u3087\u3093\u3092\u6307\u5b9a\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u518d\u3053\u3093\u3071\u3044\u3043\u308b\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u304f\u3089\u3057\u3083\u3044\u3043\u306b\u3083\u306e\u3049\u304a\u304a\u3002
compiler.warn.annotation.method.not.found=\u305f\u3044\u3043\u3077 ''{0}'' \u5185\u306b\u6ce8\u91c8\u3081\u305d\u3063\u3069 ''{1}()'' \u304c\u898b\u3061\u3085\u304b\u308a\u307e\u305b\u3093
compiler.warn.annotation.method.not.found.reason=\u305f\u3044\u3043\u3077 ''{0}'' \u5185\u306b\u6ce8\u91c8\u3081\u305d\u3063\u3069 ''{1}()'' \u304c\u898b\u3061\u3085\u304b\u308a\u307e\u305b\u3093: {2}
compiler.warn.assert.as.identifier=\u308a\u308a\u30fc\u3057\u3085 1.4 \u304b\u3089 ''assert'' \u306f\u304d\u30fc\u308f\u30fc\u3069\u306b\u3083\u306e\u3049\u304a\u304a\u308c\u3001\u8b58\u5225\u5b50\u3068\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u4f7f\u7528\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3053\u3068\u306f\u308c\u304d\u307e\u305b\u3093<br>(''assert'' \u3092\u304d\u30fc\u308f\u30fc\u3069\u3068\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u4f7f\u7528\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u306b\u306f\u3001-source 1.4 (\u307e\u305f\u306f\u305d\u308c\u4ee5\u964d\u306e\u3049\u304a\u304a\u308a\u308a\u30fc\u3057\u3085\u540d) \u3092\u4f7f\u7528\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u304f\u3089\u3057\u3083\u3044\u3043)
compiler.warn.big.major.version={0}: \u3081\u306b\u309b\u3083\u30fc\u3070\u30fc\u3058\u3087\u3093 {1} \u306f\u3001\u3053\u306e\u3049\u304a\u304a\u3053\u3093\u3071\u3044\u3043\u3089\u308c\u3057\u3083\u307d\u30fc\u3068\u3057\u3083\u308c\u3066\u3044\u3043\u308b\u6700\u65b0\u306e\u3049\u304a\u304a\u3081\u306b\u309b\u3083\u30fc\u3070\u30fc\u3058\u3087\u3093 {2} \u3088\u308a\u65b0\u3057\u3044\u3043\u308c\u3057\u3085\u3045\u3045\u3045\u3002<br>\u3053\u3093\u3071\u3044\u3043\u3089\u306e\u3049\u304a\u304a\u3041\u3042\u3042\u3042 \u3042\u3049\u3063\u3077\u3050\u308c\u30fc\u3069\u3092\u304a\uff9e\u3049\u304a\u30a9\u304a\u3093\u52e7\u3081\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3002
compiler.warn.constant.SVUID=[serial] serialVersionUID \u306f\u304f\u3089\u3057\u3085 {0} \u306e\u3049\u304a\u304a\u5b9a\u6570\u308c\u306b\u3083\u3051\u308c\u3070\u306b\u3083\u308a\u307e\u305b\u3093\u3002
compiler.warn.dir.path.element.not.found=[path] \u4e0d\u6b63\u306b\u3083\u3071\u3057\u3085\u8981\u7d20 "{0}": \u305d\u306e\u3049\u304a\u304a\u308c\u3043\u308c\u304f\u3068\u308a\u306f\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
compiler.warn.div.zero=[divzero] \u305c\u308d\u308c\u9664\u7b97
compiler.warn.empty.if=[empty] if \u4ee5\u964d\u304c\u7a7a\u306e\u3049\u304a\u304a\u6587\u308c\u3057\u3085\u3045\u3045\u3045
compiler.warn.enum.as.identifier=\u308a\u308a\u30fc\u3057\u3085 5 \u304b\u3089 ''enum'' \u306f\u304d\u30fc\u308f\u30fc\u3069\u306b\u3083\u306e\u3049\u304a\u304a\u308c\u8b58\u5225\u5b50\u3068\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u4f7f\u7528\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3053\u3068\u306f\u308c\u304d\u307e\u305b\u3093<br>(''enum'' \u3092\u304d\u30fc\u308f\u30fc\u3069\u3068\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u4f7f\u7528\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u306b\u306f -source 5 \u4ee5\u964d\u3092\u4f7f\u7528\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u304f\u3089\u3057\u3083\u3044\u3043)
compiler.warn.finally.cannot.complete=[finally] finally \u7bc0\u304c\u6b63\u5e38\u306b\u5b8c\u4e86\u308c\u304d\u307e\u305b\u3093\u3002
compiler.warn.forward.ref=\u521d\u671f\u5316\u3057\u3083\u308c\u308b\u524d\u306e\u3049\u304a\u304a\u5909\u6570 ''{0}'' \u3092\u53c2\u7167\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u306e\u3049\u304a\u304a
compiler.warn.has.been.deprecated=[deprecation] {1} \u306e\u3049\u304a\u304a {0} \u306f\u63a8\u5968\u3057\u3083\u308c\u307e\u305b\u3093\u3002
compiler.warn.illegal.char.for.encoding=\u3053\u306e\u3049\u304a\u304a\u6587\u5b57\u306f\u3001\u3048\u3093\u3053\u30fc\u308c\u3043\u3093\u3050 {0} \u306b\u307e\u3063\u3077\u308c\u304d\u307e\u305b\u3093\u3002
compiler.warn.improper.SVUID=[serial] serialVersionUID \u306f\u3001\u304f\u3089\u3057\u3085 {0} \u306b static \u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u306b\u3083\u308b\u3092\u5ba3\u8a00\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u5fc5\u8981\u304c\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.warn.inexact.non-varargs.call=\u6700\u7d42\u3071\u3089\u3081\u30fc\u305f\u306e\u3049\u304a\u304a\u4e0d\u6b63\u78ba\u306b\u3083\u5f15\u6570\u578b\u3092\u6301\u3063\u305f\u53ef\u5909\u5f15\u6570\u3081\u305d\u3063\u3069\u306e\u3049\u304a\u304a\u975e\u53ef\u5909\u5f15\u6570\u547c\u3073\u51fa\u3057;<br>\u53ef\u5909\u5f15\u6570\u547c\u3073\u51fa\u3057\u306b\u95a2\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u306f {0} \u306b\u304d\u3083\u3057\u3085\u3068\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3002<br>\u975e\u53ef\u5909\u5f15\u6570\u547c\u3073\u51fa\u3057\u306b\u95a2\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u306f {1} \u306b\u304d\u3083\u3057\u3085\u3068\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u3053\u306e\u3049\u304a\u304a\u8b66\u544a\u3092\u51fa\u3057\u3083\u306b\u3083\u3044\u3043\u3088\u3046\u306b\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3002
compiler.warn.invalid.archive.file=[path] \u3071\u3057\u3085\u4e0a\u306e\u3049\u304a\u304a\u4e88\u671f\u3057\u306b\u3083\u3044\u3043\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b: {0}
compiler.warn.long.SVUID=[serial] serialVersionUID \u306f\u3001\u304f\u3089\u3057\u3085 {0} \u306e\u3049\u304a\u304a long \u578b\u308c\u306b\u3083\u3051\u308c\u3070\u306b\u3083\u308a\u307e\u305b\u3093\u3002
compiler.warn.missing.SVUID=[serial] \u76f4\u5217\u5316\u53ef\u80fd\u306b\u3083\u304f\u3089\u3057\u3085 {0} \u306b\u306f\u3001serialVersionUID \u304c\u5b9a\u7fa9\u3057\u3083\u308c\u3066\u3044\u3043\u307e\u305b\u3093\u3002
compiler.warn.missing.deprecated.annotation=[dep-ann] \u63a8\u5968\u3057\u3083\u308c\u306b\u3083\u3044\u3043\u9805\u76ee\u306f @Deprecated \u308c\u6ce8\u91c8\u304c\u4ed8\u3051\u3089\u308c\u3066\u3044\u3043\u307e\u305b\u3093\u3002
compiler.warn.override.bridge={0}; \u304a\uff9e\u3049\u304a\u30a9\u304a\u3093\u30fc\u3070\u30fc\u3089\u3044\u3043\u3069\u3057\u3083\u308c\u305f\u3081\u305d\u3063\u3069\u306f\u3076\u308a\u3063\u3058\u3081\u305d\u3063\u3069\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.warn.override.varargs.extra={0}; \u304a\uff9e\u3049\u304a\u30a9\u304a\u3093\u30fc\u3070\u30fc\u3089\u3044\u3043\u3069\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u3044\u3043\u308b\u3081\u305d\u3063\u3069\u306b\u306f ''...'' \u304c\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u305b\u3093\u3002
compiler.warn.override.varargs.missing={0}; \u304a\uff9e\u3049\u304a\u30a9\u304a\u3093\u30fc\u3070\u30fc\u3089\u3044\u3043\u3069\u3057\u3083\u308c\u305f\u3081\u305d\u3063\u3069\u306b\u306f ''...'' \u304c\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u305b\u3093\u3002
compiler.warn.path.element.not.found=[path] \u4e0d\u6b63\u306b\u3083\u3071\u3057\u3085\u8981\u7d20 "{0}": \u305d\u306e\u3049\u304a\u304a\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b\u307e\u305f\u306f\u308c\u3043\u308c\u304f\u3068\u308a\u306f\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u305b\u3093\u3002
compiler.warn.pkg-info.already.seen=[package-info] package-info.java \u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b\u304c\u3057\u3085\u308c\u306b\u3071\u3063\u3051\u30fc\u3058 {0} \u7528\u306b\u8868\u793a\u3057\u3083\u308c\u3066\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.warn.position.overflow=\u4f4d\u7f6e\u3048\u3093\u3053\u30fc\u308c\u3043\u3093\u3050\u304c\u884c {0} \u308c\u304a\uff9e\u3049\u304a\u30a9\u304a\u3093\u30fc\u3070\u30fc\u3075\u308d\u30fc\u3057\u3085\u308b\u306e\u3049\u304a\u304a
compiler.warn.possible.fall-through.into.case=[fallthrough] case \u306b fall-through \u3057\u3085\u308b\u306e\u3049\u304a\u304a\u53ef\u80fd\u6027\u304c\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.warn.prob.found.req={0}<br>\u691c\u51fa\u5024  : {1}<br>\u671f\u5f85\u5024  : {2}
compiler.warn.proc.annotations.without.processors=\u3053\u308c\u3089\u306e\u3049\u304a\u304a\u6ce8\u91c8\u3092\u8981\u6c42\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u3077\u308d\u305b\u3063\u3057\u3083\u306f\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u305b\u3093\u308c\u3057\u305f: {0}
compiler.warn.proc.file.create.last.round=\u6700\u5f8c\u306b\u4f5c\u6210\u3057\u3083\u308c\u305f\u305f\u3044\u3043\u3077 ''{0}'' \u306e\u3049\u304a\u304a\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b\u306f\u6ce8\u91c8\u51e6\u7406\u306b\u6e21\u3057\u3083\u308c\u307e\u305b\u3093\u3002
compiler.warn.proc.file.reopening=''{0}'' \u7528\u306e\u3049\u304a\u304a\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b\u3092\u8907\u6570\u56de\u4f5c\u6210\u3057\u3088\u3046\u3068\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045
compiler.warn.proc.illegal.file.name=\u7121\u52b9\u306b\u3083\u540d\u524d ''{0}'' \u306e\u3049\u304a\u304a\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b\u306f\u4f5c\u6210\u308c\u304d\u307e\u305b\u3093\u3002
compiler.warn.proc.malformed.supported.string=\u3077\u308d\u305b\u3063\u3057\u3083 ''{1}'' \u304c\u8fd4\u3057\u305f\u3057\u3083\u307d\u30fc\u3068\u3057\u3083\u308c\u308b\u6ce8\u91c8\u578b\u306e\u3049\u304a\u304a\u6587\u5b57\u5217 ''{0}'' \u304c\u4e0d\u6b63\u308c\u3057\u3085\u3045\u3045\u3045
compiler.warn.proc.messager={0}
compiler.warn.proc.package.does.not.exist=\u3071\u3063\u3051\u30fc\u3058 {0} \u306f\u5b58\u5728\u3057\u307e\u305b\u3093
compiler.warn.proc.proc-only.requested.no.procs=\u3053\u3093\u3071\u3044\u3043\u308b\u306b\u3083\u3057\u306e\u3049\u304a\u304a\u6ce8\u91c8\u51e6\u7406\u304c\u8981\u6c42\u3057\u3083\u308c\u307e\u3057\u305f\u304c\u3001\u3077\u308d\u305b\u3063\u3057\u3083\u304c\u898b\u3061\u3085\u304b\u308a\u307e\u305b\u3093\u308c\u3057\u305f\u306e\u3049\u304a\u304a\u3002
compiler.warn.proc.processor.incompatible.source.version=\u6ce8\u91c8\u3077\u308d\u305b\u3063\u3057\u3083 ''{1}'' \u304b\u3089 -source ''{2}'' \u3088\u308a\u5c0f\u3057\u3083\u3044\u3043\u305d\u30fc\u3057\u3085\u3070\u30fc\u3058\u3087\u3093 ''{0}'' \u304c\u3057\u3083\u307d\u30fc\u3068\u3057\u3083\u308c\u3066\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045
compiler.warn.proc.type.already.exists=\u305f\u3044\u3043\u3077 ''{0}'' \u306e\u3049\u304a\u304a\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b\u306f\u65e2\u306b\u305d\u30fc\u3057\u3085\u3071\u3057\u3085\u3082\u3057\u304f\u306f\u304f\u3089\u3057\u3085\u3071\u3057\u3085\u306b\u5b58\u5728\u3057\u3085\u308b\u306e\u3049\u304a\u304a
compiler.warn.proc.type.recreate=\u305f\u3044\u3043\u3077 ''{0}'' \u306e\u3049\u304a\u304a\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b\u3092\u8907\u6570\u56de\u4f5c\u6210\u3057\u3088\u3046\u3068\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u3044\u3043\u307e\u3057\u3085\u3045\u3045\u3045
compiler.warn.proc.unclosed.type.files=\u305f\u3044\u3043\u3077 ''{0}'' \u306e\u3049\u304a\u304a\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b\u304c\u9589\u3058\u3089\u308c\u3066\u3044\u3043\u307e\u305b\u3093\u3002\u3053\u308c\u3089\u306e\u3049\u304a\u304a\u305f\u3044\u3043\u3077\u306f\u6ce8\u91c8\u51e6\u7406\u3057\u3083\u308c\u307e\u305b\u3093
compiler.warn.proc.unmatched.processor.options=\u6b21\u306e\u3049\u304a\u304a\u304a\uff9e\u3049\u304a\u30a9\u304a\u3093\u3077\u3057\u3087\u3093\u306f\u3069\u306e\u3049\u304a\u304a\u3077\u308d\u305b\u3063\u3057\u3083\u308c\u3082\u8a8d\u8b58\u3057\u3083\u308c\u307e\u305b\u3093\u308c\u3057\u305f: ''{0}''
compiler.warn.proc.use.implicit=\u6697\u9ed9\u7684\u306b\u3053\u3093\u3071\u3044\u3043\u308b\u3057\u3083\u308c\u305f\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b\u306f\u6ce8\u91c8\u51e6\u7406\u306b\u6e21\u3057\u3083\u308c\u307e\u305b\u3093\u3002<br>-implicit \u3092\u4f7f\u7528\u3057\u6697\u9ed9\u7684\u3053\u3093\u3071\u3044\u3043\u308b\u306e\u3049\u304a\u304a\u307d\u308a\u3057\u30fc\u3092\u6307\u5b9a\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u4e0b\u3057\u3083\u3044\u3043\u306b\u3083\u306e\u3049\u304a\u304a\u3002
compiler.warn.proc.use.proc.or.implicit=\u6697\u9ed9\u7684\u306b\u3053\u3093\u3071\u3044\u3043\u308b\u3057\u3083\u308c\u305f\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b\u306f\u6ce8\u91c8\u51e6\u7406\u306b\u6e21\u3057\u3083\u308c\u307e\u305b\u3093\u3002<br>-proc:none \u3092\u4f7f\u7528\u3057\u6ce8\u91c8\u51e6\u7406\u3092\u7121\u52b9\u306b\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u304b -implicit \u3092\u4f7f\u7528\u3057\u6697\u9ed9\u7684\u3053\u3093\u3071\u3044\u3043\u308b\u306e\u3049\u304a\u304a\u307d\u308a\u3057\u30fc\u3092\u6307\u5b9a\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u4e0b\u3057\u3083\u3044\u3043\u306b\u3083\u306e\u3049\u304a\u304a\u3002
compiler.warn.redundant.cast=[cast] {0} \u3078\u306e\u3049\u304a\u304a\u5197\u9577\u306b\u3083\u304d\u3083\u3057\u3085\u3068\u308c\u3057\u3085\u3045\u3045\u3045
compiler.warn.sun.proprietary={0} \u306f Sun \u304c\u6240\u6709\u3057\u3085\u308b\u306e\u3049\u304a\u304a API \u308c\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u3001\u4eca\u5f8c\u306e\u3049\u304a\u304a\u308a\u308a\u30fc\u3057\u3085\u308c\u524a\u9664\u3057\u3083\u308c\u308b\u53ef\u80fd\u6027\u304c\u3041\u3042\u3042\u3042 \u3042\u3049\u308a\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.warn.unchecked.assign=[unchecked] {0} \u304b\u3089 {1} \u3078\u306e\u3049\u304a\u304a\u7121\u691c\u67fb\u4ee3\u5165\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.warn.unchecked.assign.to.var=[unchecked] raw \u578b {1} \u306e\u3049\u304a\u304a\u3081\u3093\u3070\u30fc\u3068\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u5909\u6570 {0} \u3078\u306e\u3049\u304a\u304a\u7121\u691c\u67fb\u4ee3\u5165\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.warn.unchecked.call.mbr.of.raw.type=[unchecked] raw \u578b {1} \u306e\u3049\u304a\u304a\u3081\u3093\u3070\u3068\u3057\u3066\u3047\u3047\u3047\u3047\u309b\u306e\u3049\u304a\u304a {0} \u3078\u306e\u3049\u304a\u304a\u7121\u691c\u67fb\u547c\u3073\u51fa\u3057\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.warn.unchecked.cast.to.type=[unchecked] \u578b {0} \u3078\u306e\u3049\u304a\u304a\u7121\u691c\u67fb\u304d\u3083\u3057\u3085\u3068\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.warn.unchecked.generic.array.creation=[unchecked] \u53ef\u5909\u5f15\u6570\u3071\u3089\u3081\u30fc\u305f\u306b\u5bfe\u3057\u3085\u308b\u306e\u3049\u304a\u304a\u578b {0} \u306e\u3049\u304a\u304a\u7dcf\u79f0\u578b\u914d\u5217\u306e\u3049\u304a\u304a\u7121\u691c\u67fb\u4f5c\u6210\u308c\u3057\u3085\u3045\u3045\u3045\u3002
compiler.warn.unchecked.meth.invocation.applied=[unchecked] \u7121\u691c\u67fb\u3081\u305d\u3063\u3069\u547c\u3073\u51fa\u3057: {1} \u306e\u3049\u304a\u304a {0} \u306f {2}({3}) \u306b\u9069\u7528\u3057\u3083\u308c\u307e\u3057\u3085\u3045\u3045\u3045\u3002
compiler.warn.unexpected.archive.file=[path] \u3041\u3042\u3042\u3042 \u3042\u3049\u30fc\u304b\u3044\u3043\u3076\u3075\u3041\u3041\u309b\u3041\u309b\u3044\u3043\u308b\u306e\u3049\u304a\u304a\u4e88\u671f\u3057\u306b\u3083\u3044\u3043\u62e1\u5f35\u5b50: {0}
compiler.warn.warning=\u8b66\u544a:
ncompiler.misc.type.variable.has.undetermined.type=\u578b\u5909\u6570 {0} \u306f\u672a\u5b9a\u578b\u308c\u3057\u3085\u3045\u3045\u3045\u3002

